[
  {
    "name": "Clean and Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "middle back",
      "quadriceps",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Assume a shoulder-width stance, with knees inside the arms. Now while keeping the back flat, bend at the knees and hips so that you can grab the bar with the arms fully extended and a pronated grip that is slightly wider than shoulder width. Point the elbows out to sides. The bar should be close to the shins. Position the shoulders over or slightly ahead of the bar. Establish a flat back posture. This will be your starting position.",
      "Begin to pull the bar by extending the knees. Move your hips forward and raise the shoulders at the same rate while keeping the angle of the back constant; continue to lift the bar straight up while keeping it close to your body.",
      "As the bar passes the knee, extend at the ankles, knees, and hips forcefully, similar to a jumping motion. As you do so, continue to guide the bar with your hands, shrugging your shoulders and using the momentum from your movement to pull the bar as high as possible. The bar should travel close to your body, and you should keep your elbows out.",
      "At maximum elevation, your feet should clear the floor and you should start to pull yourself under the bar. The mechanics of this could change slightly, depending on the weight used. You should descend into a squatting position as you pull yourself under the bar.",
      "As the bar hits terminal height, rotate your elbows around and under the bar. Rack the bar across the front of the shoulders while keeping the torso erect and flexing the hips and knees to absorb the weight of the bar.",
      "Stand to full height, holding the bar in the clean position.",
      "Without moving your feet, press the bar overhead as you exhale. Lower the bar under control ."
    ],
    "category": "strength",
    "images": [
      "Clean_and_Press/0.jpg",
      "Clean_and_Press/1.jpg"
    ],
    "id": "Clean_and_Press",
    "priority_score": 86
  },
  {
    "name": "Split Snatch",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.",
      "Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees.",
      "Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.",
      "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move forcefully to a split position, one foot forward one foot back. Receive the bar with your body as low as possible and the arms fully extended overhead.",
      "Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position, bringing your feet together.",
      "Carefully return the weight to floor."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Split_Snatch/0.jpg",
      "Split_Snatch/1.jpg"
    ],
    "id": "Split_Snatch",
    "priority_score": 71
  },
  {
    "name": "Overhead Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Start out by having a barbell in front of you on the floor. Your feet should be wider than shoulder width apart from each other.",
      "Bend the knees and use a pronated grip (palms facing you) to grab the barbell. Your hands should be at a wider than shoulder width apart from each other before lifting. Once you are positioned, lift the barbell up until you can rest it on your chest.",
      "Move the barbell over and slightly behind your head and make sure your arms are fully extended. Keep your head up at all times and also maintain a straight back. Retract your shoulder blades. This is your starting position.",
      "Slowly lower the weight by bending your knees until your thighs are parallel to the ground while inhaling. Tip: Keep your back straight while performing this exercise to avoid any injuries and your arms should remain extended and over your head at all times.",
      "Now use your feet and legs to help bring the weight back up to the starting position while exhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Overhead_Squat/0.jpg",
      "Overhead_Squat/1.jpg"
    ],
    "id": "Overhead_Squat",
    "priority_score": 70
  },
  {
    "name": "Power Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "middle back",
      "quadriceps",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Stand with your feet slightly wider than shoulder width apart and toes pointing out slightly.",
      "Squat down and grasp bar with a closed, pronated grip. Your hands should be slightly wider than shoulder width apart outside knees with elbows fully extended.",
      "Place the bar about 1 inch in front of your shins and over the balls of your feet.",
      "Your back should be flat or slightly arched, your chest held up and out and your shoulder blades should be retracted.",
      "Keep your head in a neutral position (in line with vertebral column and not tilted or rotated) with your eyes focused straight ahead. Inhale during this phase.",
      "Lift the bar from the floor by forcefully extending the hips and the knees as you exhale. Tip: The upper torso should maintain the same angle. Do not bend at the waist yet and do not let the hips rise before the shoulders (this would have the effect of pushing the glutes in the air and stretching the hamstrings.",
      "Keep elbows fully extended with the head in a neutral position and the shoulders over the bar.",
      "As the bar raises keep it as close to the shins as possible.",
      "As the bar passes the knees, thrust your hips forward and slightly bend the knees to avoid locking them. Tip: At this point your thighs should be against the bar.",
      "Keep the back flat or slightly arched, elbows fully extended and your head neutral. Tip: You will hold your breath until the next phase.",
      "Inhale and then forcefully and quickly extend your hips and knees and stand on your toes.",
      "Keep the bar as close to your body as possible. Tip: Your back should be flat with the elbows pointed out to the sides and your head in a neutral position. Also, keep your shoulders over the bar and arms straight as long as possible.",
      "When your lower body joints are fully extended, shrug the shoulders upward rapidly without letting the elbows flex yet. Exhale during this portion of the movement.",
      "As the shoulders reach their highest elevation flex your elbows to begin pulling your body under the bar.",
      "Continue to pull the arms as high and as long as possible. Tip: Due to the explosive nature of this phase, your torso will be erect or with an arched back, your head will be tilted back slightly and your feet may lose contact with the floor.",
      "After the lower body has fully extended and the bar reaches near maximal height, pull your body under the bar and rotate the arms around and under the bar.",
      "Simultaneously, flex the hips and knees into a quarter squat position.",
      "Once the arms are under the bar, inhale and then lift your elbows to position the upper arms parallel to the floor. Rack the bar across the front of your collar bones and front shoulder muscles.",
      "Catch the bar with an erect and tight torso, a neutral head position and flat feet. Exhale during this movement.",
      "Stand up by extending the hips and knees to a fully erect position.",
      "Lower the bar by gradually reducing the muscular tension of the arms to allow a controlled descent of the bar to the thighs. Inhale during this movement.",
      "Simultaneously flex the hips and knees to cushion the impact of the bar on the thighs.",
      "Squat down with the elbows fully extended until the bar touches the floor.",
      "Start over at Phase 1 and repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Power_Clean/0.jpg",
      "Power_Clean/1.jpg"
    ],
    "id": "Power_Clean",
    "priority_score": 70
  },
  {
    "name": "Barbell Deadlift",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lats",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Stand in front of a loaded barbell.",
      "While keeping the back as straight as possible, bend your knees, bend forward and grasp the bar using a medium (shoulder width) overhand grip. This will be the starting position of the exercise. Tip: If it is difficult to hold on to the bar with this grip, alternate your grip or use wrist straps.",
      "While holding the bar, start the lift by pushing with your legs while simultaneously getting your torso to the upright position as you breathe out. In the upright position, stick your chest out and contract the back by bringing the shoulder blades back. Think of how the soldiers in the military look when they are in standing in attention.",
      "Go back to the starting position by bending at the knees while simultaneously leaning the torso forward at the waist while keeping the back straight. When the weights on the bar touch the floor you are back at the starting position and ready to perform another repetition.",
      "Perform the amount of repetitions prescribed in the program."
    ],
    "category": "strength",
    "images": [
      "Barbell_Deadlift/0.jpg",
      "Barbell_Deadlift/1.jpg"
    ],
    "id": "Barbell_Deadlift",
    "priority_score": 69
  },
  {
    "name": "Log Lift",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "chest",
      "glutes",
      "hamstrings",
      "lower back",
      "middle back",
      "quadriceps",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Begin standing with the log in front of you. Grasp the handles, and begin to clean the log. As you are bent over to start the clean, attempt to get the log as high as possible, pulling it into your chest. Extend through the hips and knees to bring it up to complete the clean.",
      "Push your head back and look up, creating a shelf on your chest to rest the log. Begin the press by dipping, flexing slightly through the knees and reversing the motion. This push press will generate momentum to start the log moving vertically. Continue by extending through the elbows to press the log above your head. There are no strict rules on form, so use whatever techniques you are most efficient with. As the log is pressed, ensure that you push your head through on each repetition, looking forward.",
      "Repeat as many times as possible. Attempt to control the descent of the log as it is returned to the ground."
    ],
    "category": "strongman",
    "images": [
      "Log_Lift/0.jpg",
      "Log_Lift/1.jpg"
    ],
    "id": "Log_Lift",
    "priority_score": 68
  },
  {
    "name": "Keg Load",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "middle back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "To load kegs, place the desired number a distance from the loading platform, typically 30-50 feet.",
      "Begin by grabbing the close handle of the first keg, tilting it onto its side to grab the opposite edge of the bottom of the keg. Lift the keg up to your chest.",
      "The higher you can place the keg, the faster you should be able to move to the platform. Shouldering is usually not allowed. Be sure to keep a firm hold on the keg. Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible.",
      "Return to the starting position to retrieve the next keg, and repeat until the event is completed."
    ],
    "category": "strongman",
    "images": [
      "Keg_Load/0.jpg",
      "Keg_Load/1.jpg"
    ],
    "id": "Keg_Load",
    "priority_score": 67
  },
  {
    "name": "Sandbag Load",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "middle back",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "To load sandbags or other objects, begin with the implements placed a distance from the loading platform, typically 50 feet.",
      "Begin by lifting the sandbag. Sandbags are extremely awkward, and the manner of lifting them can vary depending on the particular sandbag used. Reach as far around it as possible, extending through the hips and knees to pull it up high. Shouldering is usually not allowed.",
      "Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible. Place it onto the platform, ensuring it doesn't fall off.",
      "Return to the starting position to retrieve the next sandbag, and repeat until the event is completed."
    ],
    "category": "strongman",
    "images": [
      "Sandbag_Load/0.jpg",
      "Sandbag_Load/1.jpg"
    ],
    "id": "Sandbag_Load",
    "priority_score": 67
  },
  {
    "name": "Landmine Linear Jammer",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "chest",
      "hamstrings",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Position a bar into landmine or, lacking one, securely anchor it in a corner. Load the bar to an appropriate weight and position the handle attachment on the bar.",
      "Raise the bar from the floor, taking the handles to your shoulders. This will be your starting position.",
      "In an athletic stance, squat by flexing your hips and setting your hips back, keeping your arms flexed.",
      "Reverse the motion by powerfully extending through the hips, knees, and ankles, while also extending the elbows to straighten the arms. This movement should be done explosively, coming out of the squat to full extension as powerfully as possible.",
      "Return to the starting position."
    ],
    "category": "strength",
    "images": [
      "Landmine_Linear_Jammer/0.jpg",
      "Landmine_Linear_Jammer/1.jpg"
    ],
    "id": "Landmine_Linear_Jammer",
    "priority_score": 66
  },
  {
    "name": "Power Jerk",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.",
      "Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.",
      "At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be moved to a slightly wider stance, with the knees partially bent.",
      "Receive the bar with the arms locked out overhead.",
      "Return to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Power_Jerk/0.jpg",
      "Power_Jerk/1.jpg"
    ],
    "id": "Power_Jerk",
    "priority_score": 65
  },
  {
    "name": "Heaving Snatch Balance",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "forearms",
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "This drill helps you learn the snatch. Begin by holding a light weight across the back of the shoulders. Your feet should be slightly wider than hip width apart with the feet turned out, the same position that you would perform a squat with.",
      "Begin by dipping with the knees slightly, and popping back up to briefly unload the bar. Drive yourself underneath the bar, elevating it overhead as you descend into a full squat.",
      "Return to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Heaving_Snatch_Balance/0.jpg",
      "Heaving_Snatch_Balance/1.jpg"
    ],
    "id": "Heaving_Snatch_Balance",
    "priority_score": 64
  },
  {
    "name": "Forward Drag with Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "quadriceps",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Attach a dual handled chain or rope attachment to the sled. You should be facing away from the sled, holding a handle in each hand.",
      "Begin the movement by moving forward for one step. Leaning forward, extend through the legs and hips to move, pausing with each step to extend through the elbows, pressing your hands forward. Step forward until you return to the start position prepared to press."
    ],
    "category": "strongman",
    "images": [
      "Forward_Drag_with_Press/0.jpg",
      "Forward_Drag_with_Press/1.jpg"
    ],
    "id": "Forward_Drag_with_Press",
    "priority_score": 63
  },
  {
    "name": "Squat Jerk",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.",
      "At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athlete's effort to push the bar up will drive them down. The feet should move forcefully to just outside the hips, turned out as necessary. Receive the bar with your body in a full squat and the arms fully extended overhead.",
      "Keeping the bar aligned over the front of the heels, your head and chest up, drive throught heels of the feet to move to a standing position. Carefully return the weight to floor."
    ],
    "category": "strength",
    "images": [
      "Squat_Jerk/0.jpg",
      "Squat_Jerk/1.jpg"
    ],
    "id": "Squat_Jerk",
    "priority_score": 63
  },
  {
    "name": "Hang Snatch",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be at the hips. This will be your starting position.",
      "Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side.",
      "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead.",
      "Return to a standing position with the weight overhead. Follow by returning the weight to the ground under control."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Hang_Snatch/0.jpg",
      "Hang_Snatch/1.jpg"
    ],
    "id": "Hang_Snatch",
    "priority_score": 62
  },
  {
    "name": "Hang Snatch - Below Knees",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be just below the knees. This will be your starting position.",
      "Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side.",
      "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead.",
      "Return to a standing position with the weight overhead, and then return the weight to the floor under control."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Hang_Snatch_-_Below_Knees/0.jpg",
      "Hang_Snatch_-_Below_Knees/1.jpg"
    ],
    "id": "Hang_Snatch_-_Below_Knees",
    "priority_score": 62
  },
  {
    "name": "Power Snatch from Blocks",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.",
      "Begin the first pull by driving through the front of the heels, raising the bar from the boxes.",
      "Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.",
      "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar above a full squat and with the arms fully extended overhead.",
      "Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Power_Snatch_from_Blocks/0.jpg",
      "Power_Snatch_from_Blocks/1.jpg"
    ],
    "id": "Power_Snatch_from_Blocks",
    "priority_score": 62
  },
  {
    "name": "Snatch from Blocks",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.",
      "Begin the first pull by driving through the front of the heels, raising the bar from the boxes.",
      "Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.",
      "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar with your body as low as possible and the arms fully extended overhead.",
      "Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Snatch_from_Blocks/0.jpg",
      "Snatch_from_Blocks/1.jpg"
    ],
    "id": "Snatch_from_Blocks",
    "priority_score": 62
  },
  {
    "name": "Tire Flip",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "chest",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Begin by gripping the bottom of the tire on the tread, and position your feet back a bit. Your chest should be driving into the tire.",
      "To lift the tire, extend through the hips, knees, and ankles, driving into the tire and up.",
      "As the tire reaches a 45 degree angle, step forward and drive a knee into the tire. As you do so adjust your grip to the upper portion of the tire and push it forward as hard as possible to complete the turn. Repeat as necessary."
    ],
    "category": "strongman",
    "images": [
      "Tire_Flip/0.jpg",
      "Tire_Flip/1.jpg"
    ],
    "id": "Tire_Flip",
    "priority_score": 62
  },
  {
    "name": "Bent Press",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulders by extending through the legs and hips as you raise the kettlebell towards your shoulder. The wrist should rotate as you do so. This will be your starting position.",
      "Begin my leaning to the side opposite the kettlebell, continuing until you are able to touch the ground with your free hand, keeping your eyes on the kettlebell. As you do so, press the weight vertically be extending through the elbow, keeping your arm perpendicular to the ground.",
      "Return to an upright position, with the kettlebell above your head. Return the kettlebell to the shoulder and repeat for the desired number of repetitions."
    ],
    "category": "strength",
    "images": [
      "Bent_Press/0.jpg",
      "Bent_Press/1.jpg"
    ],
    "id": "Bent_Press",
    "priority_score": 61
  },
  {
    "name": "Pin Presses",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "forearms",
      "lats",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Pin presses remove the eccentric phase of the bench press, developing starting strength. They also allow you to train a desired range of motion.",
      "The bench should be set up in a power rack. Set the pins to the desired point in your range of motion, whether it just be lockout or an inch off of your chest. The bar should be moved to the pins and prepared for lifting.",
      "Begin by lying on the bench, with the bar directly above the contact point during your regular bench. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.",
      "You can take a standard bench grip, or shoulder width to focus on the triceps. The bar, wrist, and elbow should stay in line at all times. Focus on squeezing the bar and trying to pull it apart.",
      "Drive the bar up with as much force as possible. The elbows should be tucked in until lockout.",
      "Return the bar to the pins, pausing before beginning the next repetition."
    ],
    "category": "powerlifting",
    "images": [
      "Pin_Presses/0.jpg",
      "Pin_Presses/1.jpg"
    ],
    "id": "Pin_Presses",
    "priority_score": 61
  },
  {
    "name": "Reverse Band Bench Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "forearms",
      "lats",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Position a bench inside a power rack, with the bar set to the correct height. Begin by anchoring bands either to band pegs or to the top of the rack. Ensure that you will be position properly under the bands. Attach the other end to the barbell.",
      "Lie on the bench, tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar.",
      "Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.",
      "Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
    ],
    "category": "powerlifting",
    "images": [
      "Reverse_Band_Bench_Press/0.jpg",
      "Reverse_Band_Bench_Press/1.jpg"
    ],
    "id": "Reverse_Band_Bench_Press",
    "priority_score": 61
  },
  {
    "name": "Clean and Jerk",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "traps",
      "triceps"
    ],
    "instructions": [
      "With a barbell on the floor close to the shins, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
      "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.",
      "Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.",
      "As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.",
      "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position.",
      "The second phase is the jerk, which raises the weight overhead. Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.",
      "Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.",
      "At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be split, with one foot forward, and one foot back. Receive the bar with the arms locked out overhead. Return to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Clean_and_Jerk/0.jpg",
      "Clean_and_Jerk/1.jpg"
    ],
    "id": "Clean_and_Jerk",
    "priority_score": 60
  },
  {
    "name": "Snatch",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "biceps",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Place your feet at a shoulder width stance with the barbell resting right above the connection between the toes and the rest of the foot.",
      "With a palms facing down grip, bend at the knees and keeping the back flat grab the bar using a wider than shoulder width grip. Bring the hips down and make sure that your body drops as if you were going to sit on a chair. This will be your starting position.",
      "Start pushing the floor as if it were a moving platform with your feet and simultaneously start lifting the barbell keeping it close to your legs.",
      "As the bar reaches the middle of your thighs, push the floor with your legs and lift your body to a complete extension in an explosive motion.",
      "Lift your shoulders back in a shrugging movement as you bring the bar up while lifting your elbows out to the side and keeping them above the bar for as long as possible.",
      "Now in a very quick but powerful motion, you have to get your body under the barbell when it has reached a high enough point where it can be controlled and drop while locking your arms and holding the barbell overhead as you assume a squat position.",
      "Finalize the movement by rising up out of the squat position to finish the lift. At the end of the lift both feet should be on line and the arms fully extended holding the barbell overhead."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Snatch/0.jpg",
      "Snatch/1.jpg"
    ],
    "id": "Snatch",
    "priority_score": 60
  },
  {
    "name": "Alternating Renegade Row",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "chest",
      "lats",
      "triceps"
    ],
    "instructions": [
      "Place two kettlebells on the floor about shoulder width apart. Position yourself on your toes and your hands as though you were doing a pushup, with the body straight and extended. Use the handles of the kettlebells to support your upper body. You may need to position your feet wide for support.",
      "Push one kettlebell into the floor and row the other kettlebell, retracting the shoulder blade of the working side as you flex the elbow, pulling it to your side.",
      "Then lower the kettlebell to the floor and begin the kettlebell in the opposite hand. Repeat for several reps."
    ],
    "category": "strength",
    "images": [
      "Alternating_Renegade_Row/0.jpg",
      "Alternating_Renegade_Row/1.jpg"
    ],
    "id": "Alternating_Renegade_Row",
    "priority_score": 59
  },
  {
    "name": "Atlas Stones",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "abdominals",
      "adductors",
      "biceps",
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Begin with the atlas stone between your feet. Bend at the hips to wrap your arms vertically around the Atlas Stone, attempting to get your fingers underneath the stone. Many stones will have a small flat portion on the bottom, which will make the stone easier to hold.",
      "Pulling the stone into your torso, drive through the back half of your feet to pull the stone from the ground.",
      "As the stone passes the knees, lap it by sitting backward, pulling the stone on top of your thighs.",
      "Sit low, getting the stone high onto your chest as you change your grip to reach over the stone. Stand, driving through with your hips. Close distance to the loading platform, and lean back, extending the hips to get the stone as high as possible."
    ],
    "category": "strongman",
    "images": [
      "Atlas_Stones/0.jpg",
      "Atlas_Stones/1.jpg"
    ],
    "id": "Atlas_Stones",
    "priority_score": 59
  },
  {
    "name": "Bent-Arm Barbell Pullover",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "chest",
      "lats",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie on a flat bench with a barbell using a shoulder grip width.",
      "Hold the bar straight over your chest with a bend in your arms. This will be your starting position.",
      "While keeping your arms in the bent arm position, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.",
      "At that point, bring the barbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.",
      "Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."
    ],
    "category": "strength",
    "images": [
      "Bent-Arm_Barbell_Pullover/0.jpg",
      "Bent-Arm_Barbell_Pullover/1.jpg"
    ],
    "id": "Bent-Arm_Barbell_Pullover",
    "priority_score": 58
  },
  {
    "name": "Power Snatch",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.",
      "Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees.",
      "Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.",
      "As you move your feet into the receiving position, a slightly wider position, pull yourself below the bar as you elevate the bar overhead. The bar should be received in a partial squat. Continue raising the bar to the overhead position, receiving the bar locked out overhead.",
      "Return to a standing position with the weight over head."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Power_Snatch/0.jpg",
      "Power_Snatch/1.jpg"
    ],
    "id": "Power_Snatch",
    "priority_score": 58
  },
  {
    "name": "Rowing, Stationary",
    "force": null,
    "level": "intermediate",
    "mechanic": null,
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "biceps",
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "middle back"
    ],
    "instructions": [
      "To begin, seat yourself on the rower. Make sure that your heels are resting comfortably against the base of the foot pedals and that the straps are secured. Select the program that you wish to use, if applicable. Sit up straight and bend forward at the hips.",
      "There are three phases of movement when using a rower. The first phase is when you come forward on the rower. Your knees are bent and against your chest. Your upper body is leaning slightly forward while still maintaining good posture. Next, push against the foot pedals and extend your legs while bringing your hands to your upper abdominal area, squeezing your shoulders back as you do so. To avoid straining your back, use primarily your leg and hip muscles.",
      "The recovery phase simply involves straightening your arms, bending the knees, and bringing your body forward again as you transition back into the first phase."
    ],
    "category": "cardio",
    "images": [
      "Rowing_Stationary/0.jpg",
      "Rowing_Stationary/1.jpg"
    ],
    "id": "Rowing_Stationary",
    "priority_score": 58
  },
  {
    "name": "Snatch Balance",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Begin with the feet in the pulling position, the bar racked across the back of the shoulders, and the hands placed in a wide snatch grip.",
      "Pop the bar with an abrupt dip and drive of the knees, and aggressively drive under the bar, transitioning the feet into the receiving position.",
      "Receive the bar locked out overhead near the bottom of the squat. The torso should remain vertical, lowering the hips between the legs.",
      "Continue to descend to full depth, and return to a standing position. Carefully lower the weight."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Snatch_Balance/0.jpg",
      "Snatch_Balance/1.jpg"
    ],
    "id": "Snatch_Balance",
    "priority_score": 58
  },
  {
    "name": "Kettlebell Turkish Get-Up (Squat style)",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "hamstrings",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Lie on your back on the floor and press a kettlebell to the top position by extending the elbow. Bend the knee on the same side as the kettlebell.",
      "Keeping the kettlebell locked out at all times, pivot to the opposite side and use your non- working arm to assist you in driving forward to the lunge position.",
      "Using your free hand, push yourself to a seated position, then progressing to your feet. While looking up at the kettlebell, slowly stand up. Reverse the motion back to the starting position and repeat."
    ],
    "category": "strength",
    "images": [
      "Kettlebell_Turkish_Get-Up_Squat_style/0.jpg",
      "Kettlebell_Turkish_Get-Up_Squat_style/1.jpg"
    ],
    "id": "Kettlebell_Turkish_Get-Up_Squat_style",
    "priority_score": 57
  },
  {
    "name": "Prowler Sprint",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "chest",
      "glutes",
      "quadriceps",
      "shoulders"
    ],
    "instructions": [
      "Place your sled on an appropriate surface, loaded to a suitable weight. The sled should provide enough resistance to require effort, but not so heavy that you are significantly slowed down.",
      "You may use the upright or the low handles for this exercise. Place your hands on the handles with your arms extended, leaning into the implement.",
      "With good posture, drive through the ground with alternating, short steps. Move as fast as you can for a short distance."
    ],
    "category": "cardio",
    "images": [
      "Prowler_Sprint/0.jpg",
      "Prowler_Sprint/1.jpg"
    ],
    "id": "Prowler_Sprint",
    "priority_score": 56
  },
  {
    "name": "Snatch Deadlift",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "The snatch deadlift strengthens the first pull of the snatch. Begin with a wide snatch grip with the barbell placed on the platform. The feet should be directly under the hips, with the feet turned out. Squat down to the bar, keeping the back in absolute extension with the head facing forward.",
      "Initiate the movement by driving through the heels, raising the hips. The back angle should remain the same until the bar passes the knees.",
      "At that point, drive your hips through the bar as you lay back. Return the bar to the platform by reversing the motion."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Snatch_Deadlift/0.jpg",
      "Snatch_Deadlift/1.jpg"
    ],
    "id": "Snatch_Deadlift",
    "priority_score": 56
  },
  {
    "name": "Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "With a barbell on the floor close to the shins, take an overhand (or hook) grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
      "",
      "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.",
      "Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.",
      "As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.",
      "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Clean/0.jpg",
      "Clean/1.jpg"
    ],
    "id": "Clean",
    "priority_score": 55
  },
  {
    "name": "Clean Deadlift",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "lower back",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Begin standing with a barbell close to your shins. Your feet should be directly under your hips with your feet turned out slightly. Grip the bar with a double overhand grip or hook grip, about shoulder width apart. Squat down to the bar. Your spine should be in full extension, with a back angle that places your shoulders in front of the bar and your back as vertical as possible.",
      "Begin by driving through the floor through the front of your heels. As the bar travels upward, maintain a constant back angle. Flare your knees out to the side to help keep them out of the bar's path.",
      "After the bar crosses the knees, complete the lift by driving the hips into the bar until your hips and knees are extended."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Clean_Deadlift/0.jpg",
      "Clean_Deadlift/1.jpg"
    ],
    "id": "Clean_Deadlift",
    "priority_score": 55
  },
  {
    "name": "Deadlift with Bands",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack.",
      "With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
      "Lower the bar by bending at the hips and guiding it to the floor."
    ],
    "category": "powerlifting",
    "images": [
      "Deadlift_with_Bands/0.jpg",
      "Deadlift_with_Bands/1.jpg"
    ],
    "id": "Deadlift_with_Bands",
    "priority_score": 55
  },
  {
    "name": "Deadlift with Chains",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift.",
      "Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar.",
      "Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
      "Lower the bar by bending at the hips and guiding it to the floor."
    ],
    "category": "powerlifting",
    "images": [
      "Deadlift_with_Chains/0.jpg",
      "Deadlift_with_Chains/1.jpg"
    ],
    "id": "Deadlift_with_Chains",
    "priority_score": 55
  },
  {
    "name": "Deficit Deadlift",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Begin by having a platform or weight plates that you can stand on, usually 1-3 inches in height. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.",
      "With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
      "Lower the bar by bending at the hips and guiding it to the floor."
    ],
    "category": "powerlifting",
    "images": [
      "Deficit_Deadlift/0.jpg",
      "Deficit_Deadlift/1.jpg"
    ],
    "id": "Deficit_Deadlift",
    "priority_score": 55
  },
  {
    "name": "Frankenstein Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This drill teaches you the proper positioning of both the bar and your body during the clean and front squat.",
      "Place the barbell on the front of the shoulders, releasing your grip and extending your arms out in front of you. The shoulders should be pushed forward to create a shelf, and the bar should be in contact with the throat. Ensure that you only move your shoulder blades forward; don't round the thoracic spine.",
      "Squat by flexing the knees and hips, sitting in between your legs. Keep the torso upright, the arms up, and the shoulders forward, and the bar should stay in place. Go to the bottom of the squat, until your hamstrings contact your calves.",
      "Return to the upright position by driving through the front of the heel and extending the knees and hips."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Frankenstein_Squat/0.jpg",
      "Frankenstein_Squat/1.jpg"
    ],
    "id": "Frankenstein_Squat",
    "priority_score": 55
  },
  {
    "name": "Hang Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Your back should be straight and inclined slightly forward.",
      "Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears.",
      "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Hang_Clean/0.jpg",
      "Hang_Clean/1.jpg"
    ],
    "id": "Hang_Clean",
    "priority_score": 55
  },
  {
    "name": "Hang Clean - Below the Knees",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "Begin with a shoulder width, double overhand or hook grip, with the bar hanging just below the knees. Your back should be straight and inclined slightly forward.",
      "Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears. As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out.",
      "At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.",
      "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Hang_Clean_-_Below_the_Knees/0.jpg",
      "Hang_Clean_-_Below_the_Knees/1.jpg"
    ],
    "id": "Hang_Clean_-_Below_the_Knees",
    "priority_score": 55
  },
  {
    "name": "Iron Cross",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "chest",
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [],
    "category": "strength",
    "images": [
      "Iron_Cross/0.jpg",
      "Iron_Cross/1.jpg"
    ],
    "id": "Iron_Cross",
    "priority_score": 55
  },
  {
    "name": "One-Arm Side Deadlift",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "traps"
    ],
    "instructions": [
      "Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell.",
      "Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position.",
      "Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position.",
      "Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring.",
      "Repeat for the recommended amount of repetitions.",
      "Switch arms and repeat the movement."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Side_Deadlift/0.jpg",
      "One-Arm_Side_Deadlift/1.jpg"
    ],
    "id": "One-Arm_Side_Deadlift",
    "priority_score": 55
  },
  {
    "name": "Split Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "With a barbell on the floor close to the shins, take an overhand grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
      "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.",
      "Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.",
      "As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so.",
      "Receive the bar with the feet split, aggressively moving one foot forward and one foot back. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom position, which will help in the recovery.",
      "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Bring the feet together as you stand up."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Split_Clean/0.jpg",
      "Split_Clean/1.jpg"
    ],
    "id": "Split_Clean",
    "priority_score": 55
  },
  {
    "name": "Sumo Deadlift",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "adductors",
      "forearms",
      "glutes",
      "lower back",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.",
      "Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.",
      "As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.",
      "Return the weight to the ground by bending at the hips and controlling the weight on the way down."
    ],
    "category": "powerlifting",
    "images": [
      "Sumo_Deadlift/0.jpg",
      "Sumo_Deadlift/1.jpg"
    ],
    "id": "Sumo_Deadlift",
    "priority_score": 55
  },
  {
    "name": "Sumo Deadlift with Bands",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "adductors",
      "forearms",
      "glutes",
      "lower back",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. Ensure that they under the back half of your foot, directly where you are driving into the floor.",
      "Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip.",
      "Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.",
      "As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.",
      "Return the weight to the ground by bending at the hips and controlling the weight on the way down."
    ],
    "category": "powerlifting",
    "images": [
      "Sumo_Deadlift_with_Bands/0.jpg",
      "Sumo_Deadlift_with_Bands/1.jpg"
    ],
    "id": "Sumo_Deadlift_with_Bands",
    "priority_score": 55
  },
  {
    "name": "Sumo Deadlift with Chains",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "forearms",
      "glutes",
      "lower back",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift. Attempt to keep the ends of the chains away from the plates so you don't hit them when you lower the weight.",
      "Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.",
      "Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.",
      "As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.",
      "Return the weight to the ground by bending at the hips and controlling the weight on the way down."
    ],
    "category": "powerlifting",
    "images": [
      "Sumo_Deadlift_with_Chains/0.jpg",
      "Sumo_Deadlift_with_Chains/1.jpg"
    ],
    "id": "Sumo_Deadlift_with_Chains",
    "priority_score": 55
  },
  {
    "name": "Dumbbell Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "Begin standing with a dumbbell in each hand with your feet shoulder width apart.",
      "Lower the weights to the floor by flexing at the hips and knees, pushing your hips back until the dumbbells reach the floor. This will be your starting position.",
      "To initiate the movement, violently jump upward by extending the hips, knees, and ankles to acclerate the weights upward. Maintaining a neutral grip on the dumbbells, keep the arms straight until full extension is reached.",
      "After full extension, rebend the hips and knees to receive the weight in a squat position. Allow the arms to bend, guiding the dumbbells to your shoulders.",
      "Upon receiving the weight in the squat position, extend the hips and knees to finish in a standing position with the weights on your shoulders."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Clean/0.jpg",
      "Dumbbell_Clean/1.jpg"
    ],
    "id": "Dumbbell_Clean",
    "priority_score": 54
  },
  {
    "name": "Plie Dumbbell Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Hold a dumbbell at the base with both hands and stand straight up. Move your legs so that they are wider than shoulder width apart from each other with your knees slightly bent.",
      "Your toes should be facing out. Note: Your arms should be stationary while performing the exercise. This is the starting position.",
      "Slowly bend the knees and lower your legs until your thighs are parallel to the floor. Make sure to inhale as this is the eccentric part of the exercise.",
      "Press mainly with the heel of the foot to bring the body back to the starting position while exhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Plie_Dumbbell_Squat/0.jpg",
      "Plie_Dumbbell_Squat/1.jpg"
    ],
    "id": "Plie_Dumbbell_Squat",
    "priority_score": 54
  },
  {
    "name": "Barbell Step Ups",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck) and stand upright behind an elevated platform (such as the one used for spotting behind a flat bench). This is your starting position.",
      "Place the right foot on the elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up.",
      "Step down with the left leg by flexing the hip and knee of the right leg as you inhale. Return to the original standing position by placing the right foot of to next to the left foot on the initial position.",
      "Repeat with the right leg for the recommended amount of repetitions and then perform with the left leg."
    ],
    "category": "strength",
    "images": [
      "Barbell_Step_Ups/0.jpg",
      "Barbell_Step_Ups/1.jpg"
    ],
    "id": "Barbell_Step_Ups",
    "priority_score": 53
  },
  {
    "name": "Bench Press - Powerlifting",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "forearms",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Begin by lying on the bench, getting your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.",
      "However wide your grip, it should cover the ring on the bar. Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart.",
      "Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.",
      "Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
    ],
    "category": "powerlifting",
    "images": [
      "Bench_Press_-_Powerlifting/0.jpg",
      "Bench_Press_-_Powerlifting/1.jpg"
    ],
    "id": "Bench_Press_-_Powerlifting",
    "priority_score": 53
  },
  {
    "name": "Board Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "forearms",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Begin by lying on the bench, getting your head beyond the bar if possible. One to five boards, made out of 2x6's, can be screwed together and held in place by a training partner, bands, or just tucked under your shirt.",
      "Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.",
      "You can take a standard bench grip, or shoulder width to focus on the triceps. Pull the bar out of the rack without protracting your shoulders. The bar, wrist, and elbow should stay in line at all times. Focus on squeezing the bar and trying to pull it apart.",
      "Lower the bar to the boards, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
    ],
    "category": "powerlifting",
    "images": [
      "Board_Press/0.jpg",
      "Board_Press/1.jpg"
    ],
    "id": "Board_Press",
    "priority_score": 53
  },
  {
    "name": "Jerk Balance",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "This drill helps you learn to drive yourself low enough during the jerk and corrects those who move backward during the movement. Begin with the bar racked in the jerk position, with the shoulders forward, torso upright, and the feet split slightly apart.",
      "Initiate the movement as you would a normal jerk, dipping at the knees while keeping your torso vertical, and driving back up forcefully, using momentum and not your arms to elevate the weight.",
      "Keep the rear foot in place, using it to drive your body forward into a full split as you jerk the weight. Recover by standing up with the weight overhead."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Jerk_Balance/0.jpg",
      "Jerk_Balance/1.jpg"
    ],
    "id": "Jerk_Balance",
    "priority_score": 53
  },
  {
    "name": "Muscle Snatch",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Begin with a loaded barbell held at the mid thigh position with a wide grip. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.",
      "Begin the pull by driving through the front of the heels, raising the bar. Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body.",
      "Continue raising the bar to the overhead position, without rebending the knees."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Muscle_Snatch/0.jpg",
      "Muscle_Snatch/1.jpg"
    ],
    "id": "Muscle_Snatch",
    "priority_score": 53
  },
  {
    "name": "Split Jerk",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward.",
      "Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders. At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible.",
      "In the brief moment the feet are not actively driving against the platform, the athlete's effort to push the bar up will drive them down. The feet should be moved to a split stance, one foot forward, one foot back, with the knees partially bent. Receive the bar with the arms locked out overhead.",
      "Return to a standing position, bringing the feet together."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Split_Jerk/0.jpg",
      "Split_Jerk/1.jpg"
    ],
    "id": "Split_Jerk",
    "priority_score": 53
  },
  {
    "name": "Barbell Rollout from Bench",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Place a loaded barbell on the ground, near the end of a bench. Kneel with both legs on the bench, and take a medium to narrow grip on the barbell. This will be your starting position.",
      "To begin, extend through the hips to slowly roll the bar forward. As you roll out, flex the shoulder to roll the bar above your head. Ensure that your arms remain extended throughout the movement.",
      "When the bar has been moved as far forward as possible, return to the starting position."
    ],
    "category": "strength",
    "images": [
      "Barbell_Rollout_from_Bench/0.jpg",
      "Barbell_Rollout_from_Bench/1.jpg"
    ],
    "id": "Barbell_Rollout_from_Bench",
    "priority_score": 52
  },
  {
    "name": "Goblet Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders"
    ],
    "instructions": [
      "Stand holding a light kettlebell by the horns close to your chest. This will be your starting position.",
      "Squat down between your legs until your hamstrings are on your calves. Keep your chest and head up and your back straight.",
      "At the bottom position, pause and use your elbows to push your knees out. Return to the starting position, and repeat for 10-20 repetitions."
    ],
    "category": "strength",
    "images": [
      "Goblet_Squat/0.jpg",
      "Goblet_Squat/1.jpg"
    ],
    "id": "Goblet_Squat",
    "priority_score": 52
  },
  {
    "name": "Kettlebell Pistol Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders"
    ],
    "instructions": [
      "Pick up a kettlebell with two hands and hold it by the horns. Hold one leg off of the floor and squat down on the other.",
      "Squat down by flexing the knee and sitting back with the hips, holding the kettlebell up in front of you.",
      "Hold the bottom position for a second and then reverse the motion, driving through the heel and keeping your head and chest up.",
      "Lower yourself again and repeat."
    ],
    "category": "strength",
    "images": [
      "Kettlebell_Pistol_Squat/0.jpg",
      "Kettlebell_Pistol_Squat/1.jpg"
    ],
    "id": "Kettlebell_Pistol_Squat",
    "priority_score": 52
  },
  {
    "name": "Kettlebell Turkish Get-Up (Lunge style)",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "hamstrings",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Lie on your back on the floor and press a kettlebell to the top position by extending the elbow. Bend the knee on the same side as the kettlebell.",
      "Keeping the kettlebell locked out at all times, pivot to the opposite side and use your non- working arm to assist you in driving forward to the lunge position. Using your free hand, push yourself to a seated position, then progressing to one knee.",
      "While looking up at the kettlebell, slowly stand up. Reverse the motion back to the starting position and repeat."
    ],
    "category": "strength",
    "images": [
      "Kettlebell_Turkish_Get-Up_Lunge_style/0.jpg",
      "Kettlebell_Turkish_Get-Up_Lunge_style/1.jpg"
    ],
    "id": "Kettlebell_Turkish_Get-Up_Lunge_style",
    "priority_score": 52
  },
  {
    "name": "One-Arm Overhead Kettlebell Squats",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders"
    ],
    "instructions": [
      "Clean and press a kettlebell with one arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so. Press the weight overhead by extending through the elbow.This will be your starting position.",
      "Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up.",
      "Pause at the bottom position for a second before rising back to the top, driving through the heels of your feet."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Overhead_Kettlebell_Squats/0.jpg",
      "One-Arm_Overhead_Kettlebell_Squats/1.jpg"
    ],
    "id": "One-Arm_Overhead_Kettlebell_Squats",
    "priority_score": 52
  },
  {
    "name": "Reverse Band Box Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Begin in a power rack with a box at the appropriate height behind you. Set up the bands either on band pegs or attached to the top of the rack, ensuring they will be directly above the bar during the squat. Attach the other end to the bar.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.",
      "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
    ],
    "category": "powerlifting",
    "images": [
      "Reverse_Band_Box_Squat/0.jpg",
      "Reverse_Band_Box_Squat/1.jpg"
    ],
    "id": "Reverse_Band_Box_Squat",
    "priority_score": 52
  },
  {
    "name": "Reverse Band Sumo Deadlift",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Begin with a bar loaded on the floor inside of a power rack. Attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end to the barbell.",
      "Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.",
      "Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.",
      "As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.",
      "Return the weight to the ground by bending at the hips and controlling the weight on the way down."
    ],
    "category": "powerlifting",
    "images": [
      "Reverse_Band_Sumo_Deadlift/0.jpg",
      "Reverse_Band_Sumo_Deadlift/1.jpg"
    ],
    "id": "Reverse_Band_Sumo_Deadlift",
    "priority_score": 52
  },
  {
    "name": "Clean from Blocks",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "With a barbell on boxes or stands of the desired height, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
      "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight with the elbows pointed out.",
      "As full extension is achieved, transition into the receiving position by aggressively shrugging and flexing the arms with the elbows up and out. Aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.",
      "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position. Return the weight to the boxes for the next rep."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Clean_from_Blocks/0.jpg",
      "Clean_from_Blocks/1.jpg"
    ],
    "id": "Clean_from_Blocks",
    "priority_score": 51
  },
  {
    "name": "Double Kettlebell Alternating Hang Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "biceps",
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead.",
      "Clean one kettlebell to your shoulder and hold on to the other kettlebell.",
      "With a fluid motion, lower the top kettlebell while driving the bottom kettlebell up."
    ],
    "category": "strength",
    "images": [
      "Double_Kettlebell_Alternating_Hang_Clean/0.jpg",
      "Double_Kettlebell_Alternating_Hang_Clean/1.jpg"
    ],
    "id": "Double_Kettlebell_Alternating_Hang_Clean",
    "priority_score": 50
  },
  {
    "name": "Dumbbell Incline Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "forearms",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Using a neutral grip, lean into an incline bench.",
      "Take a dumbbell in each hand with a neutral grip, beginning with the arms straight. This will be your starting position.",
      "Retract the shoulder blades and flex the elbows to row the dumbbells to your side.",
      "Pause at the top of the motion, and then return to the starting position."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Incline_Row/0.jpg",
      "Dumbbell_Incline_Row/1.jpg"
    ],
    "id": "Dumbbell_Incline_Row",
    "priority_score": 50
  },
  {
    "name": "Front Squat (Clean Grip)",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, first set the bar in a rack slightly below shoulder level. Rest the bar on top of the deltoids, pushing into the clavicles, and lightly touching the throat. Your hands should be in a clean grip, touching the bar only with your fingers to help keep it in position.",
      "Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head and elbows up at all times. This will be your starting position.",
      "Bend at the knees, sitting down between your legs. Continue down until your hamstrings are on your calves. Keep your knees aligned with your feet by consciously using your abductors to push your knees out as you squat.",
      "Begin to raise the bar as you exhale by pushing the floor mainly with the heel or middle of your foot as you straighten the legs again and return to the starting position."
    ],
    "category": "strength",
    "images": [
      "Front_Squat_Clean_Grip/0.jpg",
      "Front_Squat_Clean_Grip/1.jpg"
    ],
    "id": "Front_Squat_Clean_Grip",
    "priority_score": 50
  },
  {
    "name": "Kipping Muscle Up",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "forearms",
      "middle back",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Grip the rings using a false grip, with the base of your palms on top of the rings.",
      "Begin with a movement swinging your legs backward slightly.",
      "Counter that movement by swinging your legs forward and up, jerking your chin and chest back, pulling yourself up with both arms as you do so. As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.",
      "Maintaining control and stability, extend through the elbow to complete the motion.",
      "Use care when lowering yourself to the ground."
    ],
    "category": "strength",
    "images": [
      "Kipping_Muscle_Up/0.jpg",
      "Kipping_Muscle_Up/1.jpg"
    ],
    "id": "Kipping_Muscle_Up",
    "priority_score": 50
  },
  {
    "name": "Muscle Up",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "forearms",
      "middle back",
      "shoulders",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Grip the rings using a false grip, with the base of your palms on top of the rings. Initiate a pull up by pulling the elbows down to your side, flexing the elbows.",
      "As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.",
      "Maintaining control and stability, extend through the elbow to complete the motion.",
      "Use care when lowering yourself to the ground."
    ],
    "category": "strength",
    "images": [
      "Muscle_Up/0.jpg",
      "Muscle_Up/1.jpg"
    ],
    "id": "Muscle_Up",
    "priority_score": 50
  },
  {
    "name": "Sled Push",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "chest",
      "glutes",
      "hamstrings",
      "triceps"
    ],
    "instructions": [
      "Load your pushing sled with the desired weight.",
      "Take an athletic posture, leaning into the sled with your arms fully extended, grasping the handles. Push the sled as fast as possible, focusing on extending your hips and knees to strengthen your posterior chain."
    ],
    "category": "strongman",
    "images": [
      "Sled_Push/0.jpg",
      "Sled_Push/1.jpg"
    ],
    "id": "Sled_Push",
    "priority_score": 50
  },
  {
    "name": "Bench Press with Chains",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Adjust the leader chain, shortening it to the desired length.Place the chains on the sleeves of the bar.",
      "Lying on the bench, get your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar.",
      "Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.",
      "Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
    ],
    "category": "powerlifting",
    "images": [
      "Bench_Press_with_Chains/0.jpg",
      "Bench_Press_with_Chains/1.jpg"
    ],
    "id": "Bench_Press_with_Chains",
    "priority_score": 49
  },
  {
    "name": "Front Raise And Pullover",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie on a flat bench while holding a barbell using a palms down grip that is about 15 inches apart.",
      "Place the bar on your upper thighs, extend your arms and lock them while keeping a slight bend on the elbows. This will be your starting position.",
      "Now raise the weight using a semicircular motion and keeping your arms straight as you inhale. Continue the same movement until the bar is on the other side above your head . (Tip: the bar will travel approximately 180-degrees). At this point your arms should be parallel to the floor with the palms of your hands facing the ceiling.",
      "Now return the barbell to the starting position by reversing the motion as you exhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Front_Raise_And_Pullover/0.jpg",
      "Front_Raise_And_Pullover/1.jpg"
    ],
    "id": "Front_Raise_And_Pullover",
    "priority_score": 49
  },
  {
    "name": "One-Arm Kettlebell Split Jerk",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position.",
      "Dip your body by bending the knees, keeping your torso upright.",
      "Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight.",
      "Receive the weight overhead by returning to a squat position underneath the weight, positioning one leg in front of you and one leg behind you.",
      "Keeping the weight overhead, return to a standing position and bring your feet together. Lower the weight to perform the next repetition."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Kettlebell_Split_Jerk/0.jpg",
      "One-Arm_Kettlebell_Split_Jerk/1.jpg"
    ],
    "id": "One-Arm_Kettlebell_Split_Jerk",
    "priority_score": 49
  },
  {
    "name": "Star Jump",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders"
    ],
    "instructions": [
      "Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.",
      "To initiate the move, squat down halfway and explode back up as high as possible. Fully extend your entire body, spreading your legs and arms away from the body.",
      "As you land, bring your limbs back in and absorb your impact through the legs."
    ],
    "category": "plyometrics",
    "images": [
      "Star_Jump/0.jpg",
      "Star_Jump/1.jpg"
    ],
    "id": "Star_Jump",
    "priority_score": 49
  },
  {
    "name": "Barbell Full Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.",
      "Begin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Full_Squat/0.jpg",
      "Barbell_Full_Squat/1.jpg"
    ],
    "id": "Barbell_Full_Squat",
    "priority_score": 48
  },
  {
    "name": "Barbell Lunge",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and step forward with your right leg and squat down through your hips, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: Do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. li>",
      "Using mainly the heel of your foot, push up and go back to the starting position as you exhale.",
      "Repeat the movement for the recommended amount of repetitions and then perform with the left leg."
    ],
    "category": "strength",
    "images": [
      "Barbell_Lunge/0.jpg",
      "Barbell_Lunge/1.jpg"
    ],
    "id": "Barbell_Lunge",
    "priority_score": 48
  },
  {
    "name": "Barbell Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack to just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to slowly lower the bar by bending the knees and hips as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Squat/0.jpg",
      "Barbell_Squat/1.jpg"
    ],
    "id": "Barbell_Squat",
    "priority_score": 48
  },
  {
    "name": "Barbell Squat To A Bench",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first place a flat bench or a box behind you. The flat bench is used to teach you to set your hips back and to hit depth.",
      "",
      "Then, set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to slowly lower the bar by bending the knees and sitting your hips back as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs and extend the hips to go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Squat_To_A_Bench/0.jpg",
      "Barbell_Squat_To_A_Bench/1.jpg"
    ],
    "id": "Barbell_Squat_To_A_Bench",
    "priority_score": 48
  },
  {
    "name": "Barbell Walking Lunge",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Begin standing with your feet shoulder width apart and a barbell across your upper back.",
      "Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.",
      "Drive through the heel of your lead foot and extend both knees to raise yourself back up.",
      "Step forward with your rear foot, repeating the lunge on the opposite leg."
    ],
    "category": "strength",
    "images": [
      "Barbell_Walking_Lunge/0.jpg",
      "Barbell_Walking_Lunge/1.jpg"
    ],
    "id": "Barbell_Walking_Lunge",
    "priority_score": 48
  },
  {
    "name": "Bent-Arm Dumbbell Pullover",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Place a dumbbell standing up on a flat bench.",
      "Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench (torso across it as in forming a cross) with only your shoulders lying on the surface. Hips should be below the bench and legs bent with feet firmly on the floor. The head will be off the bench as well.",
      "Grasp the dumbbell with both hands and hold it straight over your chest with a bend in your arms. Both palms should be pressing against the underside one of the sides of the dumbbell. This will be your starting position. Caution: Always ensure that the dumbbell used for this exercise is secure. Using a dumbbell with loose plates can result in the dumbbell falling apart and falling on your face.",
      "While keeping your arms locked in the bent arm position, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.",
      "At that point, bring the dumbbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.",
      "Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."
    ],
    "category": "strength",
    "images": [
      "Bent-Arm_Dumbbell_Pullover/0.jpg",
      "Bent-Arm_Dumbbell_Pullover/1.jpg"
    ],
    "id": "Bent-Arm_Dumbbell_Pullover",
    "priority_score": 48
  },
  {
    "name": "Box Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "The box squat allows you to squat to desired depth and develop explosive strength in the squat movement. Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.",
      "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."
    ],
    "category": "powerlifting",
    "images": [
      "Box_Squat/0.jpg",
      "Box_Squat/1.jpg"
    ],
    "id": "Box_Squat",
    "priority_score": 48
  },
  {
    "name": "Box Squat with Bands",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Begin in a power rack with a box at the appropriate height behind you. Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension. If dumbbells are used, secure them so that they don't move. Also, ensure that the dumbbells you are using are heavy enough for the bands that you are using. Additional plates can be used to hold the dumbbells down. If more tension is needed, you can either widen the base on the floor or choke the bands. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.",
      "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
    ],
    "category": "powerlifting",
    "images": [
      "Box_Squat_with_Bands/0.jpg",
      "Box_Squat_with_Bands/1.jpg"
    ],
    "id": "Box_Squat_with_Bands",
    "priority_score": 48
  },
  {
    "name": "Box Squat with Chains",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.",
      "To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.",
      "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."
    ],
    "category": "strength",
    "images": [
      "Box_Squat_with_Chains/0.jpg",
      "Box_Squat_with_Chains/1.jpg"
    ],
    "id": "Box_Squat_with_Chains",
    "priority_score": 48
  },
  {
    "name": "Front Barbell Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.",
      "Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
      "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor mainly with the middle of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Front_Barbell_Squat/0.jpg",
      "Front_Barbell_Squat/1.jpg"
    ],
    "id": "Front_Barbell_Squat",
    "priority_score": 48
  },
  {
    "name": "Front Barbell Squat To A Bench",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set a flat bench behind you and set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.",
      "Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
      "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until you touch the bench with your glutes. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor mainly with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Front_Barbell_Squat_To_A_Bench/0.jpg",
      "Front_Barbell_Squat_To_A_Bench/1.jpg"
    ],
    "id": "Front_Barbell_Squat_To_A_Bench",
    "priority_score": 48
  },
  {
    "name": "Jefferson Squats",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "traps"
    ],
    "instructions": [
      "Place a barbell on the floor.",
      "Stand in the middle of the bar length wise.",
      "Bend down by bending at the knees and keeping your back straight and grasp the front of the bar with your right hand. Your palm should be in (neutral grip) facing the left side.",
      "Grasp the rear of the bar with your left hand. The palm of your hand should be in neutral grip alignment (palms facing the right side). Tip: Ensure that your grip is even on the bar. Your torso should be positioned right in the middle of the bar and the distance between your torso and your right hand (which should be at the front) should be the same as the distance between your torso and your left hand (which should be to your back).",
      "Now stand straight up with the weight. Tip: Your feet should be shoulder width apart and your toes slightly pointed out.",
      "Squat down by bending at the knees and keeping your back straight until your upper thighs are parallel with the floor. Tip: Keep your back as vertical as possible with the floor and your head up. Also remember to not let your knees go past your toes. Inhale during this portion of the movement.",
      "Now drive yourself back up to the starting position by pushing with the feet . Tip: Keep the bar hanging at arm's length and your elbows locked with a slight bend. The arms only serve as hooks. Avoid doing any lifting with them. Do the lifting with your thighs; not your arms."
    ],
    "category": "strength",
    "images": [
      "Jefferson_Squats/0.jpg",
      "Jefferson_Squats/1.jpg"
    ],
    "id": "Jefferson_Squats",
    "priority_score": 48
  },
  {
    "name": "Kneeling Jump Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "calves",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Begin kneeling on the floor with a barbell racked across the back of your shoulders, or you can use your body weight for this exercise. This can be done inside of a power rack to make unracking easier.",
      "Sit back with your hips until your glutes touch your feet, keeping your head and chest up.",
      "Explode up with your hips, generating enough power to land with your feet flat on the floor.",
      "Continue with the squat by driving through your heels and extending the knees to come to a standing position."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Kneeling_Jump_Squat/0.jpg",
      "Kneeling_Jump_Squat/1.jpg"
    ],
    "id": "Kneeling_Jump_Squat",
    "priority_score": 48
  },
  {
    "name": "Narrow Stance Squats",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a less-than-shoulder-width narrow stance with the toes slightly pointed out. Feet should be around 3-6 inches apart. Keep your head up at all times (looking down will get you off balance) and maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Narrow_Stance_Squats/0.jpg",
      "Narrow_Stance_Squats/1.jpg"
    ],
    "id": "Narrow_Stance_Squats",
    "priority_score": 48
  },
  {
    "name": "Olympic Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Begin with a barbell supported on top of the traps. The chest should be up, and the head facing forward. Adopt a hip width stance with the feet turned out as needed.",
      "Descend by flexing the knees, refraining from moving the hips back as much as possible. This requires that the knees travel forward; ensure that they stay aligned with the feet. The goal is to keep the torso as upright as possible. Continue all the way down, keeping the weight on the front of the heel.",
      "At the moment the upper legs contact the lower, reverse the motion, driving the weight upward."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Olympic_Squat/0.jpg",
      "Olympic_Squat/1.jpg"
    ],
    "id": "Olympic_Squat",
    "priority_score": 48
  },
  {
    "name": "One Leg Barbell Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Start by standing about 2 to 3 feet in front of a flat bench with your back facing the bench. Have a barbell in front of you on the floor. Tip: Your feet should be shoulder width apart from each other.",
      "Bend the knees and use a pronated grip with your hands being wider than shoulder width apart from each other to lift the barbell up until you can rest it on your chest.",
      "Then lift the barbell over your head and rest it on the base of your neck. Move one foot back so that your toe is resting on the flat bench. Your other foot should be stationary in front of you. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. Tip: Make sure your back is straight and chest is out while performing this exercise.",
      "As you inhale, slowly lower your leg until your thigh is parallel to the floor. At this point, your knee should be over your toes. Your chest should be directly above the middle of your thigh.",
      "Leading with the chest and hips and contracting the quadriceps, elevate your leg back to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions.",
      "Switch legs and repeat the movement."
    ],
    "category": "strength",
    "images": [
      "One_Leg_Barbell_Squat/0.jpg",
      "One_Leg_Barbell_Squat/1.jpg"
    ],
    "id": "One_Leg_Barbell_Squat",
    "priority_score": 48
  },
  {
    "name": "Reverse Band Deadlift",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Set the bar up in a power rack. Attach bands to the top of the rack, using either bands pegs or the frame itself. Attach the other end of the bands to the bar.",
      "Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.",
      "With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.",
      "After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
      "Lower the bar by bending at the hips and guiding it to the floor."
    ],
    "category": "powerlifting",
    "images": [
      "Reverse_Band_Deadlift/0.jpg",
      "Reverse_Band_Deadlift/1.jpg"
    ],
    "id": "Reverse_Band_Deadlift",
    "priority_score": 48
  },
  {
    "name": "Reverse Band Power Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Begin in a power rack with the pins and bar set at the appropriate height. After loading the bar, attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end of the bands to the bar.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings.",
      "Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."
    ],
    "category": "powerlifting",
    "images": [
      "Reverse_Band_Power_Squat/0.jpg",
      "Reverse_Band_Power_Squat/1.jpg"
    ],
    "id": "Reverse_Band_Power_Squat",
    "priority_score": 48
  },
  {
    "name": "Snatch Pull",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "With a barbell on the floor close to the shins, take a wide snatch grip. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
      "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.",
      "Next comes the second pull, the main source of acceleration for the pull. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward.",
      "There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back. Full extension should be violent and abrupt, and ensure that you do not prolong the extension for longer than necessary."
    ],
    "category": "strength",
    "images": [
      "Snatch_Pull/0.jpg",
      "Snatch_Pull/1.jpg"
    ],
    "id": "Snatch_Pull",
    "priority_score": 48
  },
  {
    "name": "Speed Box Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Attach bands to the bar that are securely anchored near the ground. You may need to choke the bands to get adequate tension.",
      "Use a box of an appropriate height for this exercise. Load the bar to a weight that still requires effort, but isn't so heavy that speed is compromised. Typically, that will be between 50-70% of your one rep max.",
      "Position the bar on your upper back, shoulder blades retracted, back arched and everything tight head to toe. This will be the starting position.",
      "Unrack the bar and position yourself in front of the box. Sit back with your hips until you are seated on the box, ensuring that you descend under control and don't crash onto the surface.",
      "Pause briefly, and explode off of the box, extending through the hips and knees."
    ],
    "category": "powerlifting",
    "images": [
      "Speed_Box_Squat/0.jpg",
      "Speed_Box_Squat/1.jpg"
    ],
    "id": "Speed_Box_Squat",
    "priority_score": 48
  },
  {
    "name": "Speed Squats",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as fast as possible without involving momentum as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position. Note: You should perform these exercises as fast as possible but without breaking perfect form and without involving momentum.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Speed_Squats/0.jpg",
      "Speed_Squats/1.jpg"
    ],
    "id": "Speed_Squats",
    "priority_score": 48
  },
  {
    "name": "Squat with Bands",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.",
      "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."
    ],
    "category": "powerlifting",
    "images": [
      "Squat_with_Bands/0.jpg",
      "Squat_with_Bands/1.jpg"
    ],
    "id": "Squat_with_Bands",
    "priority_score": 48
  },
  {
    "name": "Squat with Chains",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "adductors",
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.",
      "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.",
      "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.",
      "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."
    ],
    "category": "powerlifting",
    "images": [
      "Squat_with_Chains/0.jpg",
      "Squat_with_Chains/1.jpg"
    ],
    "id": "Squat_with_Chains",
    "priority_score": 48
  },
  {
    "name": "Squat with Plate Movers",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, first set the bar on a rack to just below shoulder level. Position a weight plate on the ground a couple feet back from the rack. Once the bar is loaded, step under it and place the back of your shoulders across it.",
      "Hold on to the bar with both hands and lift it off the rack by first pushing with your legs and at the same time straighten your torso.",
      "Step away from the rack and adopt a wide stance with the toes slightly pointed out, with one foot on the weight plate. Keep your head up at all times. This will be your starting position.",
      "Begin to slowly lower the bar by bending the knees and hips. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees.",
      "Raise the bar as you exhale by pushing the floor with the heels of your feet as you extend the hips and knees.",
      "At the top of the movement, side step, bringing your feet together on the opposite side of the plate.",
      "Using your inside foot, push the weight plate, sliding it across the floor to where you were just standing.",
      "Place your inside foot on the weight plate, adopting a wide stance for the next repetition."
    ],
    "category": "strength",
    "images": [
      "Squat_with_Plate_Movers/0.jpg",
      "Squat_with_Plate_Movers/1.jpg"
    ],
    "id": "Squat_with_Plate_Movers",
    "priority_score": 48
  },
  {
    "name": "Straight-Arm Dumbbell Pullover",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Place a dumbbell standing up on a flat bench.",
      "Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench (torso across it as in forming a cross) with only your shoulders lying on the surface. Hips should be below the bench and legs bent with feet firmly on the floor. The head will be off the bench as well.",
      "Grasp the dumbbell with both hands and hold it straight over your chest at arms length. Both palms should be pressing against the underside one of the sides of the dumbbell. This will be your starting position.\nCaution: Always ensure that the dumbbell used for this exercise is secure. Using a dumbbell with loose plates can result in the dumbbell falling apart and falling on your face.",
      "While keeping your arms straight, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.",
      "At that point, bring the dumbbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.",
      "Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."
    ],
    "category": "strength",
    "images": [
      "Straight-Arm_Dumbbell_Pullover/0.jpg",
      "Straight-Arm_Dumbbell_Pullover/1.jpg"
    ],
    "id": "Straight-Arm_Dumbbell_Pullover",
    "priority_score": 48
  },
  {
    "name": "Weighted Jump Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Position a lightly loaded barbell across the back of your shoulders. You could also use a weighted vest, sandbag, or other type of resistance for this exercise.",
      "The weight should be light enough that it doesn't slow you down significantly. Your feet should be just outside of shoulder width with your head and chest up. This will be your starting position.",
      "Using a countermovement, squat partially down and immediately reverse your direction to explode off of the ground, extending through your hips, knees, and ankles. Maintain good posture throughout the jump.",
      "As you return to the ground, absorb the impact through your legs."
    ],
    "category": "strength",
    "images": [
      "Weighted_Jump_Squat/0.jpg",
      "Weighted_Jump_Squat/1.jpg"
    ],
    "id": "Weighted_Jump_Squat",
    "priority_score": 48
  },
  {
    "name": "Weighted Sissy Squat",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Standing upright, with feet at shoulder width and toes raised, use one hand to hold onto the beams of a squat rack and the opposite arm to hold a plate on top of your chest. This is your starting position.",
      "As you use one arm to hold yourself, bend at the knees and slowly lower your torso toward the ground by bringing your pelvis and knees forward. Inhale as you go down and stop when your upper and lower legs almost create a 90-degree angle. Hold the stretch position for a second.",
      "After your one second hold, use your thigh muscles to bring your torso back up to the starting position. Exhale as you move up.",
      "Repeat for the recommended amount of times."
    ],
    "category": "strength",
    "images": [
      "Weighted_Sissy_Squat/0.jpg",
      "Weighted_Sissy_Squat/1.jpg"
    ],
    "id": "Weighted_Sissy_Squat",
    "priority_score": 48
  },
  {
    "name": "Wide Stance Barbell Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a wider-than-shoulder-width stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance, and also maintain a straight back. This will be your starting position.",
      "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Wide_Stance_Barbell_Squat/0.jpg",
      "Wide_Stance_Barbell_Squat/1.jpg"
    ],
    "id": "Wide_Stance_Barbell_Squat",
    "priority_score": 48
  },
  {
    "name": "Zercher Squats",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. The correct height should be anywhere above the waist but below the chest. Once the correct height is chosen and the bar is loaded, lock your hands together and place the bar on top of your arms in between the forearm and upper arm.",
      "Lift the bar up so that it is resting on top of your forearms. If you are holding the bar properly, it should look as if you have your arms crossed but with a bar running across them.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the ball of your foot mainly as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Zercher_Squats/0.jpg",
      "Zercher_Squats/1.jpg"
    ],
    "id": "Zercher_Squats",
    "priority_score": 48
  },
  {
    "name": "Barbell Rear Delt Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "middle back"
    ],
    "instructions": [
      "Stand up straight while holding a barbell using a wide (higher than shoulder width) and overhand (palms facing your body) grip.",
      "Bend knees slightly and bend over as you keep the natural arch of your back. Let the arms hang in front of you as they hold the bar. Once your torso is parallel to the floor, flare the elbows out and away from your body. Tip: Your torso and your arms should resemble the letter \"T\". Now you are ready to begin the exercise.",
      "While keeping the upper arms perpendicular to the torso, pull the barbell up towards your upper chest as you squeeze the rear delts and you breathe out. Tip: When performed correctly, this exercise should resemble a bench press in reverse. Also, refrain from using your biceps to do the work. Focus on targeting the rear delts; the arms should only act as hooks.",
      "Slowly go back to the initial position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Rear_Delt_Row/0.jpg",
      "Barbell_Rear_Delt_Row/1.jpg"
    ],
    "id": "Barbell_Rear_Delt_Row",
    "priority_score": 47
  },
  {
    "name": "Bent Over Barbell Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Holding a barbell with a pronated grip (palms facing down), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
      "Now, while keeping the torso stationary, breathe out and lift the barbell to you. Keep the elbows close to the body and only use the forearms to hold the weight. At the top contracted position, squeeze the back muscles and hold for a brief pause.",
      "Then inhale and slowly lower the barbell back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Bent_Over_Barbell_Row/0.jpg",
      "Bent_Over_Barbell_Row/1.jpg"
    ],
    "id": "Bent_Over_Barbell_Row",
    "priority_score": 47
  },
  {
    "name": "Clean Pull",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "lower back",
      "traps"
    ],
    "instructions": [
      "With a barbell on the floor close to the shins, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
      "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight and elbows out. Move the weight with control as you continue to above the knees.",
      "Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended. Full extension should be violent and abrupt, and ensure that you do not prolong the extension for longer than necessary."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Clean_Pull/0.jpg",
      "Clean_Pull/1.jpg"
    ],
    "id": "Clean_Pull",
    "priority_score": 47
  },
  {
    "name": "Dumbbell Lunges",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.",
      "Step forward with your right leg around 2 feet or so from the foot being left stationary behind and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground.",
      "Using mainly the heel of your foot, push up and go back to the starting position as you exhale.",
      "Repeat the movement for the recommended amount of repetitions and then perform with the left leg."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Lunges/0.jpg",
      "Dumbbell_Lunges/1.jpg"
    ],
    "id": "Dumbbell_Lunges",
    "priority_score": 47
  },
  {
    "name": "Dumbbell Rear Lunge",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.",
      "Step backward with your right leg around two feet or so from the left foot and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Tip: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground. Keep the torso upright during the lunge; flexible hip flexors are important. A long lunge emphasizes the Gluteus Maximus; a short lunge emphasizes Quadriceps.",
      "Push up and go back to the starting position as you exhale. Tip: Use the ball of your feet to push in order to accentuate the quadriceps. To focus on the glutes, press with your heels.",
      "Now repeat with the opposite leg."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Rear_Lunge/0.jpg",
      "Dumbbell_Rear_Lunge/1.jpg"
    ],
    "id": "Dumbbell_Rear_Lunge",
    "priority_score": 47
  },
  {
    "name": "Dumbbell Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).",
      "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.",
      "Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until your thighs are parallel to the floor. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise your torso as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Squat/0.jpg",
      "Dumbbell_Squat/1.jpg"
    ],
    "id": "Dumbbell_Squat",
    "priority_score": 47
  },
  {
    "name": "Dumbbell Squat To A Bench",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Stand up straight with a flat bench behind you while holding a dumbbell on each hand (palms facing the side of your legs).",
      "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.",
      "Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Squat_To_A_Bench/0.jpg",
      "Dumbbell_Squat_To_A_Bench/1.jpg"
    ],
    "id": "Dumbbell_Squat_To_A_Bench",
    "priority_score": 47
  },
  {
    "name": "Kettlebell Sumo High Pull",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [
      "adductors",
      "glutes",
      "hamstrings",
      "quadriceps",
      "shoulders"
    ],
    "instructions": [
      "Place a kettlebell on the ground between your feet. Position your feet in a wide stance, and grasp the kettlebell with two hands. Set your hips back as far as possible, with your knees bent. Keep your chest and head up. This will be your starting position.",
      "Begin by extending the hips and knees, simultaneously pulling the kettlebell to your shoulders, raising your elbows as you do so. Reverse the motion to return to the starting position."
    ],
    "category": "strength",
    "images": [
      "Kettlebell_Sumo_High_Pull/0.jpg",
      "Kettlebell_Sumo_High_Pull/1.jpg"
    ],
    "id": "Kettlebell_Sumo_High_Pull",
    "priority_score": 47
  },
  {
    "name": "Press Sit-Up",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "To begin, lie down on a bench with a barbell resting on your chest. Position your legs so they are secure on the extension of the abdominal bench. This is the starting position.",
      "While inhaling, tighten your abdominals and glutes. Simultaneously curl your torso as you do when performing a sit-up and press the barbell to an overhead position while exhaling. Tip: Use your arms to push the barbell out as you perform this exercise while still focusing on the abdominal muscles.",
      "Lower your upper body back down to the starting position while bringing the barbell back down to your torso. Remember to breathe in while lowering the body.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Press_Sit-Up/0.jpg",
      "Press_Sit-Up/1.jpg"
    ],
    "id": "Press_Sit-Up",
    "priority_score": 47
  },
  {
    "name": "Rack Pull with Bands",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Attach bands to the base of the rack, or secure them with dumbbells. Attach the other end to the bar. You may need to choke the bands to provide tension.",
      "Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight.",
      "With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement. Return the weight to the pins and repeat."
    ],
    "category": "powerlifting",
    "images": [
      "Rack_Pull_with_Bands/0.jpg",
      "Rack_Pull_with_Bands/1.jpg"
    ],
    "id": "Rack_Pull_with_Bands",
    "priority_score": 47
  },
  {
    "name": "Reverse Grip Bent-Over Rows",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Stand erect while holding a barbell with a supinated grip (palms facing up).",
      "Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
      "While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.",
      "Slowly lower the weight again to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Reverse_Grip_Bent-Over_Rows/0.jpg",
      "Reverse_Grip_Bent-Over_Rows/1.jpg"
    ],
    "id": "Reverse_Grip_Bent-Over_Rows",
    "priority_score": 47
  },
  {
    "name": "Bent Over Two-Dumbbell Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "With a dumbbell in each hand (palms facing your torso), bend your knees slightly and bring your torso forward by bending at the waist; as you bend make sure to keep your back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
      "While keeping the torso stationary, lift the dumbbells to your side (as you breathe out), keeping the elbows close to the body (do not exert any force with the forearm other than holding the weights). On the top contracted position, squeeze the back muscles and hold for a second.",
      "Slowly lower the weight again to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Bent_Over_Two-Dumbbell_Row/0.jpg",
      "Bent_Over_Two-Dumbbell_Row/1.jpg"
    ],
    "id": "Bent_Over_Two-Dumbbell_Row",
    "priority_score": 46
  },
  {
    "name": "Double Kettlebell Windmill",
    "force": "pull",
    "level": "intermediate",
    "mechanic": null,
    "equipment": "kettlebells",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Place a kettlebell in front of your front foot and clean and press a kettlebell overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so, so that the palm faces forward.",
      "Keeping the kettlebell locked out at all times, push your butt out in the direction of the locked out kettlebell. Turn your feet out at a forty-five degree angle from the arm with the locked out kettlebell.",
      "Bending at the hip to one side, sticking your butt out, slowly lean until you can retrieve the kettlebell from the floor. Keep your eyes on the kettlebell that you hold over your head at all times.",
      "Pause for a second after retrieving the kettlebell from the ground and reverse the motion back to the starting position."
    ],
    "category": "strength",
    "images": [
      "Double_Kettlebell_Windmill/0.jpg",
      "Double_Kettlebell_Windmill/1.jpg"
    ],
    "id": "Double_Kettlebell_Windmill",
    "priority_score": 46
  },
  {
    "name": "Freehand Jump Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Cross your arms over your chest.",
      "With your head up and your back straight, position your feet at shoulder width.",
      "Keeping your back straight and chest up, squat down as you inhale until your upper thighs are parallel, or lower, to the floor.",
      "Now pressing mainly with the ball of your feet, jump straight up in the air as high as possible, using the thighs like springs. Exhale during this portion of the movement.",
      "When you touch the floor again, immediately squat down and jump again.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Freehand_Jump_Squat/0.jpg",
      "Freehand_Jump_Squat/1.jpg"
    ],
    "id": "Freehand_Jump_Squat",
    "priority_score": 46
  },
  {
    "name": "Kettlebell Windmill",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Place a kettlebell in front of your lead foot and clean and press it overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so, so that the palm faces forward. Press it overhead by extending the elbow.",
      "Keeping the kettlebell locked out at all times, push your butt out in the direction of the locked out kettlebell. Turn your feet out at a forty-five degree angle from the arm with the locked out kettlebell. Bending at the hip to one side, sticking your butt out, slowly lean until you can touch the floor with your free hand. Keep your eyes on the kettlebell that you hold over your head at all times.",
      "Pause for a second after reaching the ground and reverse the motion back to the starting position."
    ],
    "category": "strength",
    "images": [
      "Kettlebell_Windmill/0.jpg",
      "Kettlebell_Windmill/1.jpg"
    ],
    "id": "Kettlebell_Windmill",
    "priority_score": 46
  },
  {
    "name": "One-Arm Dumbbell Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Choose a flat bench and place a dumbbell on each side of it.",
      "Place the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.",
      "Use the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.",
      "Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.",
      "Lower the resistance straight down to the starting position. Breathe in as you perform this step.",
      "Repeat the movement for the specified amount of repetitions.",
      "Switch sides and repeat again with the other arm."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Dumbbell_Row/0.jpg",
      "One-Arm_Dumbbell_Row/1.jpg"
    ],
    "id": "One-Arm_Dumbbell_Row",
    "priority_score": 46
  },
  {
    "name": "One-Arm Open Palm Kettlebell Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders"
    ],
    "instructions": [
      "Place one kettlebell between your feet.",
      "Grab the handle with one hand and raise the kettlebell rapidly, let it flip so that the ball of the kettlebell lands in the palm of your hand.",
      "Throw the kettlebell out in front of you and catch the handle with one hand.",
      "Take the kettlebell to the floor and repeat. Make sure to work both arms."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Open_Palm_Kettlebell_Clean/0.jpg",
      "One-Arm_Open_Palm_Kettlebell_Clean/1.jpg"
    ],
    "id": "One-Arm_Open_Palm_Kettlebell_Clean",
    "priority_score": 46
  },
  {
    "name": "Axle Deadlift",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an over/under grip.",
      "With your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.",
      "After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
      "Lower the bar by bending at the hips and guiding it to the floor."
    ],
    "category": "strongman",
    "images": [
      "Axle_Deadlift/0.jpg",
      "Axle_Deadlift/1.jpg"
    ],
    "id": "Axle_Deadlift",
    "priority_score": 45
  },
  {
    "name": "Close-Grip Push-Up off of a Dumbbell",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Lie on the floor and place your hands on an upright dumbbell. Supporting your weight on your toes and hands, keep your torso rigid and your elbows in with your arms straight. This will be your starting position.",
      "Lower your body, allowing the elbows to flex while you inhale. Keep your body straight, not allowing your hips to rise or sag.",
      "Press yourself back up to the starting position by extending the elbows. Breathe out as you perform this step.",
      "After a pause at the contracted position, repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Close-Grip_Push-Up_off_of_a_Dumbbell/0.jpg",
      "Close-Grip_Push-Up_off_of_a_Dumbbell/1.jpg"
    ],
    "id": "Close-Grip_Push-Up_off_of_a_Dumbbell",
    "priority_score": 45
  },
  {
    "name": "Incline Push-Up Medium",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
      "Place your hands on the bar, with your hands about shoulder width apart.",
      "Position your feet back from the bar with arms and body straight. This will be your starting position.",
      "Keeping your body straight, lower your chest to the bar by bending the arms.",
      "Return to the starting position by extending the elbows, pressing yourself back up."
    ],
    "category": "strength",
    "images": [
      "Incline_Push-Up_Medium/0.jpg",
      "Incline_Push-Up_Medium/1.jpg"
    ],
    "id": "Incline_Push-Up_Medium",
    "priority_score": 45
  },
  {
    "name": "Incline Push-Up Reverse Grip",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
      "Place your hands on the bar palms up, with your hands about shoulder width apart.",
      "Position your feet back from the bar with arms and body straight. This will be your starting position.",
      "Keeping your body straight, lower your chest to the bar by bending the arms.",
      "Return to the starting position by extending the elbows, pressing yourself back up."
    ],
    "category": "strength",
    "images": [
      "Incline_Push-Up_Reverse_Grip/0.jpg",
      "Incline_Push-Up_Reverse_Grip/1.jpg"
    ],
    "id": "Incline_Push-Up_Reverse_Grip",
    "priority_score": 45
  },
  {
    "name": "Incline Push-Up Wide",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
      "Place your hands on the bar, with your hands wider than shoulder width.",
      "Position your feet back from the bar with arms and body straight. Your arms should be perpendicular to the body. This will be your starting position.",
      "Keeping your body straight, lower your chest to the bar by bending the arms.",
      "Return to the starting position by extending the elbows, pressing yourself back up."
    ],
    "category": "strength",
    "images": [
      "Incline_Push-Up_Wide/0.jpg",
      "Incline_Push-Up_Wide/1.jpg"
    ],
    "id": "Incline_Push-Up_Wide",
    "priority_score": 45
  },
  {
    "name": "Push-Up Wide",
    "force": null,
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "With your hands wide apart, support your body on your toes and hands in a plank position. Your elbows should be extended and your body straight. Do not allow your hips to sag. This will be your starting position.",
      "To begin, allow the elbows to flex, lowering your chest to the floor as you inhale.",
      "Using your pectoral muscles, press your upper body back up to the starting position by extending the elbows. Exhale as you perform this step.",
      "After pausing at the contracted position, repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Push-Up_Wide/0.jpg",
      "Push-Up_Wide/1.jpg"
    ],
    "id": "Push-Up_Wide",
    "priority_score": 45
  },
  {
    "name": "Push Press - Behind the Neck",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "calves",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Standing with the weight racked on the back of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, moving the bar in a vertical path.",
      "Using the momentum generated, finish pressing the weight overhead be extending through the arms.",
      "Return to the starting position, using your legs to absorb the impact."
    ],
    "category": "olympic weightlifting",
    "images": [
      "Push_Press_-_Behind_the_Neck/0.jpg",
      "Push_Press_-_Behind_the_Neck/1.jpg"
    ],
    "id": "Push_Press_-_Behind_the_Neck",
    "priority_score": 45
  },
  {
    "name": "Push Up to Side Plank",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Get into pushup position on the toes with your hands just outside of shoulder width.",
      "Perform a pushup by allowing the elbows to flex. As you descend, keep your body straight.",
      "Do one pushup and as you come up, shift your weight on the left side of the body, twist to the side while bringing the right arm up towards the ceiling in a side plank.",
      "Lower the arm back to the floor for another pushup and then twist to the other side.",
      "Repeat the series, alternating each side, for 10 or more reps."
    ],
    "category": "strength",
    "images": [
      "Push_Up_to_Side_Plank/0.jpg",
      "Push_Up_to_Side_Plank/1.jpg"
    ],
    "id": "Push_Up_to_Side_Plank",
    "priority_score": 45
  },
  {
    "name": "V-Bar Pullup",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Start by placing the middle of the V-bar in the middle of the pull-up bar (assuming that the pull-up station you are using does not have neutral grip handles). The V-Bar handles will be facing down so that you can hang from the pull-up bar through the use of the handles.",
      "Once you securely place the V-bar, take a hold of the bar from each side and hang from it. Stick your chest out and lean yourself back slightly in order to better engage the lats. This will be your starting position.",
      "Using your lats, pull your torso up while leaning your head back slightly so that you do not hit yourself with the chin-up bar. Continue until your chest nearly touches the V-bar. Exhale as you execute this motion.",
      "After a second hold on the contracted position, slowly lower your body back to the starting position as you breathe in.",
      "Repeat for the prescribed number of repetitions."
    ],
    "category": "strength",
    "images": [
      "V-Bar_Pullup/0.jpg",
      "V-Bar_Pullup/1.jpg"
    ],
    "id": "V-Bar_Pullup",
    "priority_score": 45
  },
  {
    "name": "Vertical Swing",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "quadriceps",
      "shoulders"
    ],
    "instructions": [
      "Allow the dumbbell to hang at arms length between your legs, holding it with both hands. Keep your back straight and your head up.",
      "Swing the dumbbell between your legs, flexing at the hips and bending the knees slightly.",
      "Powerfully reverse the motion by extending at the hips, knees, and ankles to propel yourself upward, swinging the dumbell over your head.",
      "As you land, absorb the impact through your legs and draw the dumbbell to your torso before the next repetition."
    ],
    "category": "plyometrics",
    "images": [
      "Vertical_Swing/0.jpg",
      "Vertical_Swing/1.jpg"
    ],
    "id": "Vertical_Swing",
    "priority_score": 45
  },
  {
    "name": "Wide-Grip Rear Pull-Up",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Grab the pull-up bar with the palms facing forward using a wide grip.",
      "As you have both arms extended in front of you holding the bar, bring your torso forward and head so that there is an imaginary line from the pull-up bar to the back of your neck. This is your starting position.",
      "Pull your torso up until the bar is near the back of your neck. To do this, draw the shoulders and upper arms down and back while slightly leaning your head forward. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
      "After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Wide-Grip_Rear_Pull-Up/0.jpg",
      "Wide-Grip_Rear_Pull-Up/1.jpg"
    ],
    "id": "Wide-Grip_Rear_Pull-Up",
    "priority_score": 45
  },
  {
    "name": "Cable Deadlifts",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Move the cables to the bottom of the towers and select an appropriate weight. Stand directly in between the uprights.",
      "To begin, squat down be flexing your hips and knees until you can reach the handles.",
      "After grasping them, begin your ascent. Driving through your heels extend your hips and knees keeping your hands hanging at your side. Keep your head and chest up throughout the movement.",
      "After reaching a full standing position, Return to the starting position and repeat."
    ],
    "category": "strength",
    "images": [
      "Cable_Deadlifts/0.jpg",
      "Cable_Deadlifts/1.jpg"
    ],
    "id": "Cable_Deadlifts",
    "priority_score": 44
  },
  {
    "name": "Close-Grip Front Lat Pulldown",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.",
      "Grab the bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.",
      "As you have both arms extended in front of you - while holding the bar at the chosen grip width - bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.",
      "As you breathe out, bring the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary (only the arms should move). The forearms should do no other work except for holding the bar; therefore do not try to pull the bar down using the forearms.",
      "After a second in the contracted position, while squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement.",
      "6. Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Close-Grip_Front_Lat_Pulldown/0.jpg",
      "Close-Grip_Front_Lat_Pulldown/1.jpg"
    ],
    "id": "Close-Grip_Front_Lat_Pulldown",
    "priority_score": 44
  },
  {
    "name": "Full Range-Of-Motion Lat Pulldown",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Either standing or seated on a high bench, grasp two stirrup cables that are attached to the high pulleys. Grab with the opposing hand so your arms are crisscrossed about you and your palms are facing forward.",
      "Keeping your chest up and maintaining a slight arch in your lower back, pull the handles down as if you were doing a regular pulldown. The range of motion will be more of an arc. During the movement, rotate your hands so that in the bottom position your palms face each other rather than forward. Return slowly to the starting position and repeat."
    ],
    "category": "strength",
    "images": [
      "Full_Range-Of-Motion_Lat_Pulldown/0.jpg",
      "Full_Range-Of-Motion_Lat_Pulldown/1.jpg"
    ],
    "id": "Full_Range-Of-Motion_Lat_Pulldown",
    "priority_score": 44
  },
  {
    "name": "Lunge Pass Through",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "quadriceps"
    ],
    "instructions": [
      "Stand with your torso upright holding a kettlebell in your right hand. This will be your starting position.",
      "Step forward with your left foot and lower your upper body down by flexing the hip and the knee, keeping the torso upright. Lower your back knee until it nearly touches the ground.",
      "As you lunge, pass the kettlebell under your front leg to your opposite hand.",
      "Pressing through the heel of your foot, return to the starting position.",
      "Repeat the movement for the recommended amount of repetitions, alternating legs."
    ],
    "category": "strength",
    "images": [
      "Lunge_Pass_Through/0.jpg",
      "Lunge_Pass_Through/1.jpg"
    ],
    "id": "Lunge_Pass_Through",
    "priority_score": 44
  },
  {
    "name": "One-Arm Kettlebell Snatch",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Place a kettlebell between your feet. Bend your knees and push your butt back to get in the proper starting position.",
      "Look straight ahead and swing the kettlebell back between your legs.",
      "Immediately reverse the direction and drive through with your hips and knees, accelerating the kettlebell upward. As the kettlebell rises to your shoulder rotate your hand and punch straight up, using momentum to receive the weight locked out overhead."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Kettlebell_Snatch/0.jpg",
      "One-Arm_Kettlebell_Snatch/1.jpg"
    ],
    "id": "One-Arm_Kettlebell_Snatch",
    "priority_score": 44
  },
  {
    "name": "Pallof Press",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Connect a standard handle to a tower, andif possibleposition the cable to shoulder height. If not, a low pulley will suffice.",
      "With your side to the cable, grab the handle with both hands and step away from the tower. You should be approximately arm's length away from the pulley, with the tension of the weight on the cable.",
      "With your feet positioned hip-width apart and knees slightly bent, hold the cable to the middle of your chest. This will be your starting position.",
      "Press the cable away from your chest, fully extending both arms. You core should be tight and engaged.",
      "Hold the repetition for several seconds before returning to the starting position.",
      "At the conclusion of the set, repeat facing the other direction."
    ],
    "category": "strength",
    "images": [
      "Pallof_Press/0.jpg",
      "Pallof_Press/1.jpg"
    ],
    "id": "Pallof_Press",
    "priority_score": 44
  },
  {
    "name": "Pallof Press With Rotation",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Connect a standard handle to a tower, and position the cable to shoulder height.",
      "With your side to the cable, grab the handle with one hand and step away from the tower. You should be approximately arm's length away from the pulley, with the tension of the weight on the cable. Align outstretched arm with cable.",
      "With your feet positioned hip-width apart, pull the cable into your chest and grab the handle with your other hand. Both hands should be on the handle at this time.",
      "Facing forward, press the cable away from your chest. You core should be tight and engaged.",
      "Keeping your hips straight, twist your torso away from the pulley until you get a full quarter rotation.",
      "Maintain your rigid stance and straight arms. Return to the neutral position in a slow and controlled manner. Your arms should be extended in front of you.",
      "With the side tension still engaging your core, bring your hands to your chest and immediately press outward to a fully extended position. This constitutes one rep.",
      "Repeat to failure.",
      "Then, reposition and repeat the same series of movements on the opposite side."
    ],
    "category": "strength",
    "images": [
      "Pallof_Press_With_Rotation/0.jpg",
      "Pallof_Press_With_Rotation/1.jpg"
    ],
    "id": "Pallof_Press_With_Rotation",
    "priority_score": 44
  },
  {
    "name": "Rickshaw Carry",
    "force": null,
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Position the frame at the starting point, and load with the appropriate weight. Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame. Ensure your chest and head are up and your back is straight.",
      "Immediately begin walking briskly with quick, controlled steps. Keep your chest up and head forward, and make sure you continue breathing. Bring the frame to the ground after you have reached the end point."
    ],
    "category": "strongman",
    "images": [
      "Rickshaw_Carry/0.jpg",
      "Rickshaw_Carry/1.jpg"
    ],
    "id": "Rickshaw_Carry",
    "priority_score": 44
  },
  {
    "name": "Seated Cable Rows",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "For this exercise you will need access to a low pulley row machine with a V-bar. Note: The V-bar will enable you to have a neutral grip where the palms of your hands face each other. To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.",
      "Lean over as you keep the natural alignment of your back and grab the V-bar handles.",
      "With your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.",
      "Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Seated_Cable_Rows/0.jpg",
      "Seated_Cable_Rows/1.jpg"
    ],
    "id": "Seated_Cable_Rows",
    "priority_score": 44
  },
  {
    "name": "Underhand Cable Pulldowns",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Sit down on a pull-down machine with a wide bar attached to the top pulley. Adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.",
      "Grab the pull-down bar with the palms facing your torso (a supinated grip). Make sure that the hands are placed closer than the shoulder width.",
      "As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.",
      "As you breathe out, pull the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the fully contracted position and keep the elbows close to your body. The upper torso should remain stationary as your bring the bar to you and only the arms should move. The forearms should do no other work other than hold the bar.",
      "After a second on the contracted position, while breathing in, slowly bring the bar back to the starting position when your arms are fully extended and the lats are fully stretched.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Underhand_Cable_Pulldowns/0.jpg",
      "Underhand_Cable_Pulldowns/1.jpg"
    ],
    "id": "Underhand_Cable_Pulldowns",
    "priority_score": 44
  },
  {
    "name": "V-Bar Pulldown",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Sit down on a pull-down machine with a V-Bar attached to the top pulley.",
      "Adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.",
      "Grab the V-bar with the palms facing each other (a neutral grip). Stick your chest out and lean yourself back slightly (around 30-degrees) in order to better engage the lats. This will be your starting position.",
      "Using your lats, pull the bar down as you squeeze your shoulder blades. Continue until your chest nearly touches the V-bar. Exhale as you execute this motion. Tip: Keep the torso stationary throughout the movement.",
      "After a second hold on the contracted position, slowly bring the bar back to the starting position as you breathe in.",
      "Repeat for the prescribed number of repetitions."
    ],
    "category": "strength",
    "images": [
      "V-Bar_Pulldown/0.jpg",
      "V-Bar_Pulldown/1.jpg"
    ],
    "id": "V-Bar_Pulldown",
    "priority_score": 44
  },
  {
    "name": "Wide-Grip Lat Pulldown",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.",
      "Grab the bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.",
      "As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.",
      "As you breathe out, bring the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the bar; therefore do not try to pull down the bar using the forearms.",
      "After a second at the contracted position squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Wide-Grip_Lat_Pulldown/0.jpg",
      "Wide-Grip_Lat_Pulldown/1.jpg"
    ],
    "id": "Wide-Grip_Lat_Pulldown",
    "priority_score": 44
  },
  {
    "name": "Wide-Grip Pulldown Behind The Neck",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.",
      "Grab the bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.",
      "As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso and head forward. Think of an imaginary line from the center of the bar down to the back of your neck. This is your starting position.",
      "As you breathe out, bring the bar down until it touches the back of your neck by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the bar; therefore do not try to pull down the bar using the forearms.",
      "After a second on the contracted position squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Wide-Grip_Pulldown_Behind_The_Neck/0.jpg",
      "Wide-Grip_Pulldown_Behind_The_Neck/1.jpg"
    ],
    "id": "Wide-Grip_Pulldown_Behind_The_Neck",
    "priority_score": 44
  },
  {
    "name": "Alternating Floor Press",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie on the floor with two kettlebells next to your shoulders.",
      "Position one in place on your chest and then the other, gripping the kettlebells on the handle with the palms facing forward.",
      "Extend both arms, so that the kettlebells are being held above your chest. Lower one kettlebell, bringing it to your chest and turn the wrist in the direction of the locked out kettlebell.",
      "Raise the kettlebell and repeat on the opposite side."
    ],
    "category": "strength",
    "images": [
      "Alternating_Floor_Press/0.jpg",
      "Alternating_Floor_Press/1.jpg"
    ],
    "id": "Alternating_Floor_Press",
    "priority_score": 43
  },
  {
    "name": "Barbell Hack Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "hamstrings"
    ],
    "instructions": [
      "Stand up straight while holding a barbell behind you at arms length and your feet at shoulder width. Tip: A shoulder width grip is best with the palms of your hands facing back. You can use wrist wraps for this exercise for a better grip. This will be your starting position.",
      "While keeping your head and eyes up and back straight, squat until your upper thighs are parallel to the floor. Breathe in as you slowly go down.",
      "Pressing mainly with the heel of the foot and squeezing the thighs, go back up as you breathe out.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Hack_Squat/0.jpg",
      "Barbell_Hack_Squat/1.jpg"
    ],
    "id": "Barbell_Hack_Squat",
    "priority_score": 43
  },
  {
    "name": "Chair Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, first set the bar to a position that best matches your height. Once the bar is loaded, step under it and position it across the back of your shoulders.",
      "Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs.",
      "Move your feet forward about 18 inches in front of the bar. Position your legs using a shoulder width stance with the toes slightly pointed out. Look forward at all times and maintain a neutral or slightly arched spine. This will be your starting position.",
      "Slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper and lower leg breaks 90 degrees.",
      "Begin to raise the bar as you exhale by pushing the floor with the heels of your feet, extending the knees and returning to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Chair_Squat/0.jpg",
      "Chair_Squat/1.jpg"
    ],
    "id": "Chair_Squat",
    "priority_score": 43
  },
  {
    "name": "Elevated Back Lunge",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Position a bar onto a rack at shoulder height loaded to an appropriate weight. Place a short, raised platform behind you.",
      "Rack the bar onto your upper back, keeping your back arched and tight. Step onto your raised platform with both feet. This will be your starting position.",
      "Begin by stepping backwards with one leg. Descend by flexing your hips and knees until your knee touches the floor.",
      "Pause, and extend through the hips and knees to rise up, returning all the way to the starting position before alternating."
    ],
    "category": "strength",
    "images": [
      "Elevated_Back_Lunge/0.jpg",
      "Elevated_Back_Lunge/1.jpg"
    ],
    "id": "Elevated_Back_Lunge",
    "priority_score": 43
  },
  {
    "name": "Hack Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Place the back of your torso against the back pad of the machine and hook your shoulders under the shoulder pads provided.",
      "Position your legs in the platform using a shoulder width medium stance with the toes slightly pointed out. Tip: Keep your head up at all times and also maintain the back on the pad at all times.",
      "Place your arms on the side handles of the machine and disengage the safety bars (which on most designs is done by moving the side handles from a facing front position to a diagonal position).",
      "Now straighten your legs without locking the knees. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
      "Begin to slowly lower the unit by bending the knees as you maintain a straight posture with the head up (back on the pad at all times). Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the unit as you exhale by pushing the floor with mainly with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Hack_Squat/0.jpg",
      "Hack_Squat/1.jpg"
    ],
    "id": "Hack_Squat",
    "priority_score": 43
  },
  {
    "name": "Leg Press",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
      "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.",
      "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.",
      "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."
    ],
    "category": "strength",
    "images": [
      "Leg_Press/0.jpg",
      "Leg_Press/1.jpg"
    ],
    "id": "Leg_Press",
    "priority_score": 43
  },
  {
    "name": "Lunge Sprint",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Adjust a bar in a Smith machine to an appropriate height. Position yourself under the bar, racking it across the back of your shoulders. Unrack the bar, and then split your feet, moving one foot forward and one foot back. This will be your starting position.",
      "Lower your back knee nearly to the ground, flexing the knees and lowering your hips as you do so.",
      "At the bottom of the descent, immediately reverse direction. Explosively drive through the heel of your front foot with light pressure from your back foot. Jump up and reverse the position of your legs.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Lunge_Sprint/0.jpg",
      "Lunge_Sprint/1.jpg"
    ],
    "id": "Lunge_Sprint",
    "priority_score": 43
  },
  {
    "name": "Lying Machine Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Adjust the leg machine to a height that will allow you to get inside it with your knees bent and the thighs slightly below parallel.",
      "Once you select the weight, position yourself inside the machine face up with the knees bent and thighs slightly below parallel to the platform. Make sure that the knees do not go past the toes. The angle created between the hamstrings and the calves should be one that is slightly less than 90 degrees (since your starting position requires you to start slightly below parallel). Your back and your head should be resting on the machine while your shoulders are pressed under the shoulder pads.",
      "Place your hands by the handles and position your feet slightly pointing out at a shoulder width position. This will be your starting position.",
      "While pressing with the balls of the feet as you breathe out, make your whole body erect as you squeeze the quads. Hold the contracted position for a second. Tip: Since you are starting below parallel, you can opt to use your hands to help you up by pressing on your thighs only on the first repetition.",
      "Slowly squat down as you inhale but instead of going all the way down to the starting position, just stop once your thighs are parallel to the platform. The angle between your hamstrings and calves should be a 90-degree angle.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Lying_Machine_Squat/0.jpg",
      "Lying_Machine_Squat/1.jpg"
    ],
    "id": "Lying_Machine_Squat",
    "priority_score": 43
  },
  {
    "name": "Narrow Stance Hack Squats",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Place the back of your torso against the back pad of the machine and hook your shoulders under the shoulder pads provided.",
      "Position your legs in the platform using a less than shoulder width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.",
      "Place your arms on the side handles of the machine and disengage the safety bars (which on most designs is done by moving the side handles from a facing front position to a diagonal position).",
      "Now straighten your legs without locking the knees. This will be your starting position.",
      "Begin to slowly lower the unit by bending the knees as you maintain a straight posture with the head up (back on the pad at all times). Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement.",
      "Begin to raise the unit as you exhale by pushing the floor with mainly with the heels of your feet as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Narrow_Stance_Hack_Squats/0.jpg",
      "Narrow_Stance_Hack_Squats/1.jpg"
    ],
    "id": "Narrow_Stance_Hack_Squats",
    "priority_score": 43
  },
  {
    "name": "Narrow Stance Leg Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a less-than-shoulder-width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.",
      "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.",
      "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.",
      "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."
    ],
    "category": "strength",
    "images": [
      "Narrow_Stance_Leg_Press/0.jpg",
      "Narrow_Stance_Leg_Press/1.jpg"
    ],
    "id": "Narrow_Stance_Leg_Press",
    "priority_score": 43
  },
  {
    "name": "Smith Machine Leg Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Position a Smith machine bar a couple feet off of the ground. Ensure that it is resting on the safeties. After loading the bar to an appropriate weight, lie underneath the bar. Place the middle of your feet on the bar, tucking your knees to your chest. This will be your starting position.",
      "Begin the movement by driving through your feet to move the bar upward, extending the hips and knees. Do not lock out your knees.",
      "At the top of the motion, pause briefly before returning to the starting position."
    ],
    "category": "strength",
    "images": [
      "Smith_Machine_Leg_Press/0.jpg",
      "Smith_Machine_Leg_Press/1.jpg"
    ],
    "id": "Smith_Machine_Leg_Press",
    "priority_score": 43
  },
  {
    "name": "Smith Machine Pistol Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, first set the bar to a position that best matches your height. Step under it and position the bar across the back of your shoulders.",
      "Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs. 3",
      "Move one foot forward about 12 inches in front of the bar. Extend the other leg out in front of you, holding it off the ground. Look forward at all times and maintain a neutral or slightly arched spine. This will be your starting position.",
      "Maintaining good posture, lower yourself by flexing the knee and hip, going down as far as flexibility allows.",
      "Pause briefly at the bottom and then return to the starting position by driving through the heel of your foot, extending the knee and hip."
    ],
    "category": "strength",
    "images": [
      "Smith_Machine_Pistol_Squat/0.jpg",
      "Smith_Machine_Pistol_Squat/1.jpg"
    ],
    "id": "Smith_Machine_Pistol_Squat",
    "priority_score": 43
  },
  {
    "name": "Smith Machine Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "To begin, first set the bar on the height that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side (palms facing forward), unlock it and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Smith_Machine_Squat/0.jpg",
      "Smith_Machine_Squat/1.jpg"
    ],
    "id": "Smith_Machine_Squat",
    "priority_score": 43
  },
  {
    "name": "Smith Single-Leg Split Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, place a flat bench 2-3 feet behind the smith machine. Then, set the bar on the height that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side (palms facing forward), unlock it and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Position your legs by placing one foot slightly forward under the bar and extending your other leg back and place the top of your foot on the bench. This will be your starting position",
      "Begin to slowly lower the bar by bending the knee as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calf becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knee should make an imaginary straight line with the toes that is perpendicular to the front. If your knee is past that imaginary line (if it is past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten your leg again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions.",
      "Switch legs and repeat the movement."
    ],
    "category": "strength",
    "images": [
      "Smith_Single-Leg_Split_Squat/0.jpg",
      "Smith_Single-Leg_Split_Squat/1.jpg"
    ],
    "id": "Smith_Single-Leg_Split_Squat",
    "priority_score": 43
  },
  {
    "name": "Catch and Overhead Throw",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "medicine ball",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "abdominals",
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Begin standing while facing a wall or a partner.",
      "Using both hands, position the ball behind your head, stretching as much as possible, and forcefully throw the ball forward.",
      "Ensure that you follow your throw through, being prepared to receive your rebound from your throw. If you are throwing against the wall, make sure that you stand close enough to the wall to receive the rebound, and aim a little higher than you would with a partner."
    ],
    "category": "plyometrics",
    "images": [
      "Catch_and_Overhead_Throw/0.jpg",
      "Catch_and_Overhead_Throw/1.jpg"
    ],
    "id": "Catch_and_Overhead_Throw",
    "priority_score": 42
  },
  {
    "name": "Double Kettlebell Snatch",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Place two kettlebells behind your feet. Bend your knees and sit back to pick up the kettlebells.",
      "Swing the kettlebells between your legs forcefully and reverse the direction.",
      "Drive through with your hips and lock the ketttlebells overhead in one uninterrupted motion."
    ],
    "category": "strength",
    "images": [
      "Double_Kettlebell_Snatch/0.jpg",
      "Double_Kettlebell_Snatch/1.jpg"
    ],
    "id": "Double_Kettlebell_Snatch",
    "priority_score": 42
  },
  {
    "name": "Dumbbell Seated Box Jump",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Position a box a couple feet to the side of a bench. Hold a dumbbell to your chest with both hands and seat yourself on the bench facing the box. This will be your starting position.",
      "Plant your feet firmly on the ground as you lean forward, extending through the hips and knees to jump up and forward.",
      "Land on the box with both feet, absorbing the impact by allowing the hips and knees to bend.",
      "Step down and return to the starting position."
    ],
    "category": "plyometrics",
    "images": [
      "Dumbbell_Seated_Box_Jump/0.jpg",
      "Dumbbell_Seated_Box_Jump/1.jpg"
    ],
    "id": "Dumbbell_Seated_Box_Jump",
    "priority_score": 42
  },
  {
    "name": "Dumbbell Step Ups",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).",
      "Place the right foot on the elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up.",
      "Step down with the left leg by flexing the hip and knee of the right leg as you inhale. Return to the original standing position by placing the right foot of to next to the left foot on the initial position.",
      "Repeat with the right leg for the recommended amount of repetitions and then perform with the left leg."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Step_Ups/0.jpg",
      "Dumbbell_Step_Ups/1.jpg"
    ],
    "id": "Dumbbell_Step_Ups",
    "priority_score": 42
  },
  {
    "name": "Medicine Ball Scoop Throw",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "medicine ball",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "abdominals",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Assume a semisquat stance with a medicine ball in your hands. Your arms should hang so the ball is near your feet.",
      "Begin by thrusting the hips forward as you extend through the legs, jumping up.",
      "As you do, swing your arms up and over your head, keeping them extended, releasing the ball at the peak of your movement. The goal is to throw the ball the greatest distance behind you."
    ],
    "category": "plyometrics",
    "images": [
      "Medicine_Ball_Scoop_Throw/0.jpg",
      "Medicine_Ball_Scoop_Throw/1.jpg"
    ],
    "id": "Medicine_Ball_Scoop_Throw",
    "priority_score": 42
  },
  {
    "name": "Open Palm Kettlebell Clean",
    "force": "pull",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders"
    ],
    "instructions": [
      "Place one kettlebell between your feet. Clean the kettlebell by extending through the legs and hips as you raise the kettlebell towards your shoulders.",
      "Release the kettlebell as it comes up, and let it flip so that the ball of the kettlebell lands in the palms of your hands.",
      "Release the kettlebell out in front of you and catch the handle with both hands. Lower the kettlebell to the starting position and repeat."
    ],
    "category": "strength",
    "images": [
      "Open_Palm_Kettlebell_Clean/0.jpg",
      "Open_Palm_Kettlebell_Clean/1.jpg"
    ],
    "id": "Open_Palm_Kettlebell_Clean",
    "priority_score": 42
  },
  {
    "name": "Smith Machine Bent Over Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Set the barbell attached to the smith machine to a height that is about 2 inches below your knees.",
      "Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up.",
      "Now grasp the barbell using an overhand (pronated) grip and unlock it from the smith machine rack. Then let it hang directly in front of you as your arms hang extended perpendicular to the floor and your torso. This is your starting position.",
      "While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.",
      "Slowly lower the weight again to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Smith_Machine_Bent_Over_Row/0.jpg",
      "Smith_Machine_Bent_Over_Row/1.jpg"
    ],
    "id": "Smith_Machine_Bent_Over_Row",
    "priority_score": 42
  },
  {
    "name": "Split Squat with Dumbbells",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Position yourself into a staggered stance with the rear foot elevated and front foot forward.",
      "Hold a dumbbell in each hand, letting them hang at the sides. This will be your starting position.",
      "Begin by descending, flexing your knee and hip to lower your body down. Maintain good posture througout the movement. Keep the front knee in line with the foot as you perform the exercise.",
      "At the bottom of the movement, drive through the heel to extend the knee and hip to return to the starting position."
    ],
    "category": "strength",
    "images": [
      "Split_Squat_with_Dumbbells/0.jpg",
      "Split_Squat_with_Dumbbells/1.jpg"
    ],
    "id": "Split_Squat_with_Dumbbells",
    "priority_score": 42
  },
  {
    "name": "Squats - With Bands",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "bands",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "To start out, make sure that the exercise band is at an even split between both the left and right side of the body. To do this, use your hands to grab both sides of the band and place both feet in the middle of the band. Your feet should be shoulder width apart from each other.",
      "When holding the bands, they should be the same height on each side. You should be using a pronated grip (palms facing forward) and have the handles of the bands next to your face for this exercise. This is the starting position.",
      "Slowly start to bend the knees and lower the legs so that your thighs are parallel to the floor while exhaling.",
      "Use the heel of your feet to push your body up to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Squats_-_With_Bands/0.jpg",
      "Squats_-_With_Bands/1.jpg"
    ],
    "id": "Squats_-_With_Bands",
    "priority_score": 42
  },
  {
    "name": "Supine One-Arm Overhead Throw",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "medicine ball",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Lay on the ground on your back with your knees bent. Hold the ball with one hand, extending the arm fully behind your head. This will be your starting position.",
      "Initiate the movement at the shoulder, throwing the ball directly forward of you as you sit up, attempting to go for maximum distance.",
      "The ball can be thrown to a partner or bounced off of a wall."
    ],
    "category": "plyometrics",
    "images": [
      "Supine_One-Arm_Overhead_Throw/0.jpg",
      "Supine_One-Arm_Overhead_Throw/1.jpg"
    ],
    "id": "Supine_One-Arm_Overhead_Throw",
    "priority_score": 42
  },
  {
    "name": "Supine Two-Arm Overhead Throw",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "medicine ball",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Lay on the ground on your back with your knees bent.",
      "Hold the ball with both hands, extending the arms fully behind your head. This will be your starting position.",
      "Initiate the movement at the shoulder, throwing the ball directly forward of you as you sit up, attempting to go for maximum distance.",
      "The ball can be thrown to a partner or bounced off of a wall."
    ],
    "category": "plyometrics",
    "images": [
      "Supine_Two-Arm_Overhead_Throw/0.jpg",
      "Supine_Two-Arm_Overhead_Throw/1.jpg"
    ],
    "id": "Supine_Two-Arm_Overhead_Throw",
    "priority_score": 42
  },
  {
    "name": "Bench Jump",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Begin with a box or bench 1-2 feet in front of you. Stand with your feet shoulder width apart. This will be your starting position.",
      "Perform a short squat in preparation for the jump; swing your arms behind you.",
      "Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible. Swing your arms forward and up.",
      "Jump over the bench, landing with the knees bent, absorbing the impact through the legs.",
      "Turn around and face the opposite direction, then jump back over the bench."
    ],
    "category": "plyometrics",
    "images": [
      "Bench_Jump/0.jpg",
      "Bench_Jump/1.jpg"
    ],
    "id": "Bench_Jump",
    "priority_score": 41
  },
  {
    "name": "Bodyweight Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your feet shoulder width apart. You can place your hands behind your head. This will be your starting position.",
      "Begin the movement by flexing your knees and hips, sitting back with your hips.",
      "Continue down to full depth if you are able,and quickly reverse the motion until you return to the starting position. As you squat, keep your head and chest up and push your knees out."
    ],
    "category": "strength",
    "images": [
      "Bodyweight_Squat/0.jpg",
      "Bodyweight_Squat/1.jpg"
    ],
    "id": "Bodyweight_Squat",
    "priority_score": 41
  },
  {
    "name": "Conan's Wheel",
    "force": null,
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "calves",
      "forearms",
      "lower back",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "With the weight loaded, take a zurcher hold on the end of the implement. Place the bar in the crook of the elbow and hold onto your wrist. Try to keep the weight off of the forearms.",
      "Begin by lifting the weight from the ground. Keep a tight, upright posture as you being to walk, taking short, fast steps. Look up and away as you turn in a circle. Do not hold your breath during the event. Continue walking until you complete one or more complete turns."
    ],
    "category": "strongman",
    "images": [
      "Conans_Wheel/0.jpg",
      "Conans_Wheel/1.jpg"
    ],
    "id": "Conans_Wheel",
    "priority_score": 41
  },
  {
    "name": "Double Kettlebell Push Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "calves",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Clean two kettlebells to your shoulders.",
      "Squat down a few inches and reverse the motion rapidly. Use the momentum from the legs to drive the kettlebells overhead.",
      "Once the kettlebells are locked out, lower the kettlebells to your shoulders and repeat."
    ],
    "category": "strength",
    "images": [
      "Double_Kettlebell_Push_Press/0.jpg",
      "Double_Kettlebell_Push_Press/1.jpg"
    ],
    "id": "Double_Kettlebell_Push_Press",
    "priority_score": 41
  },
  {
    "name": "Double Leg Butt Kick",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Begin standing with your knees slightly bent.",
      "Quickly squat a short distance, flexing the hips and knees, and immediately extend to jump for maximum vertical height.",
      "As you go up, tuck your heels by flexing the knees, attempting to touch the buttocks.",
      "Finish the motion by landing with the knees only partially bent, using your legs to absorb the impact."
    ],
    "category": "plyometrics",
    "images": [
      "Double_Leg_Butt_Kick/0.jpg",
      "Double_Leg_Butt_Kick/1.jpg"
    ],
    "id": "Double_Leg_Butt_Kick",
    "priority_score": 41
  },
  {
    "name": "Fast Skipping",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Start in a relaxed position with one leg slightly forward. This will be your starting position.",
      "Skip by executing a step-hop pattern of right-right-step to left-left-step, and so on, alternating back and forth.",
      "Perform fast skips by maintaining close contact with the ground and reduce air time, moving as quickly as possible."
    ],
    "category": "plyometrics",
    "images": [
      "Fast_Skipping/0.jpg",
      "Fast_Skipping/1.jpg"
    ],
    "id": "Fast_Skipping",
    "priority_score": 41
  },
  {
    "name": "Knee Tuck Jump",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "quadriceps"
    ],
    "instructions": [
      "Begin in a comfortable standing position with your knees slightly bent. Hold your hands in front of you, palms down with your fingertips together at chest height. This will be your starting position.",
      "Rapidly dip down into a quarter squat and immediately explode upward. Drive the knees towards the chest, attempting to touch them to the palms of the hands.",
      "Jump as high as you can, raising your knees up, and then ensure a good land be re-extending your legs, absorbing impact through be allowing the knees to rebend."
    ],
    "category": "plyometrics",
    "images": [
      "Knee_Tuck_Jump/0.jpg",
      "Knee_Tuck_Jump/1.jpg"
    ],
    "id": "Knee_Tuck_Jump",
    "priority_score": 41
  },
  {
    "name": "Lateral Bound",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [
      "abductors",
      "calves",
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Assume a half squat position facing 90 degrees from your direction of travel. This will be your starting position.",
      "Allow your lead leg to do a countermovement inward as you shift your weight to the outside leg.",
      "Immediately push off and extend, attempting to bound to the side as far as possible.",
      "Upon landing, immediately push off in the opposite direction, returning to your original start position.",
      "Continue back and forth for several repetitions."
    ],
    "category": "plyometrics",
    "images": [
      "Lateral_Bound/0.jpg",
      "Lateral_Bound/1.jpg"
    ],
    "id": "Lateral_Bound",
    "priority_score": 41
  },
  {
    "name": "One-Arm Kettlebell Push Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "calves",
      "quadriceps",
      "triceps"
    ],
    "instructions": [
      "Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position.",
      "Dip your body by bending the knees, keeping your torso upright.",
      "Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight. Lower the weight to perform the next repetition."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Kettlebell_Push_Press/0.jpg",
      "One-Arm_Kettlebell_Push_Press/1.jpg"
    ],
    "id": "One-Arm_Kettlebell_Push_Press",
    "priority_score": 41
  },
  {
    "name": "Power Stairs",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "adductors",
      "calves",
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "In the power stairs, implements are moved up a staircase. For training purposes, these can be performed with a tire or box.",
      "Begin by taking the implement with both hands. Set your feet wide, with your head and chest up. Drive through the ground with your heels, extending your knees and hips to raise the weight from the ground.",
      "As you lean back, attempt to swing the weight onto the stairs, which are usually around 16-18\" high. You can use your legs to help push the weight onto the stair.",
      "Repeat for 3-5 repetitions, and continue with a heavier weight, moving as fast as possible."
    ],
    "category": "strongman",
    "images": [
      "Power_Stairs/0.jpg",
      "Power_Stairs/1.jpg"
    ],
    "id": "Power_Stairs",
    "priority_score": 41
  },
  {
    "name": "Sledgehammer Swings",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "lats",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "You will need a tire and a sledgehammer for this exercise. Stand in front of the tire about two feet away from it with a staggered stance. Grip the sledgehammer.",
      "If you are right handed, your left hand should be at the bottom of the handle, and your right hand should be choking up closer to the head.",
      "As you bring the sledge up, your right hand slides toward the head; as you swing down, your right hand will slide down to join your left hand. Slam it down as hard as you can against the tire. Control the bounce of the hammer off of the tire.",
      "Repeat on the other side."
    ],
    "category": "plyometrics",
    "images": [
      "Sledgehammer_Swings/0.jpg",
      "Sledgehammer_Swings/1.jpg"
    ],
    "id": "Sledgehammer_Swings",
    "priority_score": 41
  },
  {
    "name": "Smith Machine Hang Power Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "lower back",
      "quadriceps",
      "shoulders",
      "traps"
    ],
    "instructions": [
      "Position the bar at knee height and load it to an appropriate weight.",
      "Take a pronated grip on the bar outside of shoulder width and unhook the bar from the machine. Your arms should be fully extended with your head and chest up. Your elbows should be pointed out with your shoulders back and down. Your hips should be back, loading the tension into the hamstrings. This will be your starting position.",
      "Initate the movement by forcefully extending the hips and knees, accelerating into the bar. Ensure that you keep your arms straight during this part of the motion.",
      "Upon full extension, rebend the hips and knees to lower your receiving position.",
      "Allow the arms to flex at this point, rotating the elbows around the bar to receive it on your shoulders.",
      "Extend through the hips and knees to come to a standing position with the bar racked on your shoulders to complete the movement."
    ],
    "category": "strength",
    "images": [
      "Smith_Machine_Hang_Power_Clean/0.jpg",
      "Smith_Machine_Hang_Power_Clean/1.jpg"
    ],
    "id": "Smith_Machine_Hang_Power_Clean",
    "priority_score": 41
  },
  {
    "name": "Split Jump",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.",
      "Ensure that the front knee is over the midline of the foot.",
      "Extending through both legs, jump as high as possible, swinging your arms to gain lift.",
      "As you jump, bring your feet together, and move them back to their initial positions as you land.",
      "Absorb the impact by reverting back to the starting position."
    ],
    "category": "plyometrics",
    "images": [
      "Split_Jump/0.jpg",
      "Split_Jump/1.jpg"
    ],
    "id": "Split_Jump",
    "priority_score": 41
  },
  {
    "name": "Standing Long Jump",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This drill is best done in sand or other soft landing surface. Ensure that you are able to measure distance. Stand in a partial squat stance with feet shoulder width apart.",
      "Utilizing a big arm swing and a countermovement of the legs, jump forward as far as you can.",
      "Attempt to land with your feet out in front you, reaching as far as possible with your legs.",
      "Measure the distance from your landing point to the starting point and track results."
    ],
    "category": "plyometrics",
    "images": [
      "Standing_Long_Jump/0.jpg",
      "Standing_Long_Jump/1.jpg"
    ],
    "id": "Standing_Long_Jump",
    "priority_score": 41
  },
  {
    "name": "Step-up with Knee Raise",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Stand facing a box or bench of an appropriate height with your feet together. This will be your starting position.",
      "Begin the movement by stepping up, putting your left foot on the top of the bench. Extend through the hip and knee of your front leg to stand up on the box. As you stand on the box with your left leg, flex your right knee and hip, bringing your knee as high as you can.",
      "Reverse this motion to step down off the box, and then repeat the sequence on the opposite leg."
    ],
    "category": "strength",
    "images": [
      "Step-up_with_Knee_Raise/0.jpg",
      "Step-up_with_Knee_Raise/1.jpg"
    ],
    "id": "Step-up_with_Knee_Raise",
    "priority_score": 41
  },
  {
    "name": "Alternating Hang Clean",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "kettlebells",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "biceps",
      "calves",
      "forearms",
      "glutes",
      "lower back",
      "traps"
    ],
    "instructions": [
      "Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead.",
      "Clean one kettlebell to your shoulder and hold on to the other kettlebell in a hanging position. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so.",
      "Lower the cleaned kettlebell to a hanging position and clean the alternate kettlebell. Repeat."
    ],
    "category": "strength",
    "images": [
      "Alternating_Hang_Clean/0.jpg",
      "Alternating_Hang_Clean/1.jpg"
    ],
    "id": "Alternating_Hang_Clean",
    "priority_score": 40
  },
  {
    "name": "Barbell Bench Press - Medium Grip",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on a flat bench. Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "From the starting position, breathe in and begin coming down slowly until the bar touches your middle chest.",
      "After a brief pause, push the bar back to the starting position as you breathe out. Focus on pushing the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position at the top of the motion, hold for a second and then start coming down slowly again. Tip: Ideally, lowering the weight should take about twice as long as raising it.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Barbell_Bench_Press_-_Medium_Grip/0.jpg",
      "Barbell_Bench_Press_-_Medium_Grip/1.jpg"
    ],
    "id": "Barbell_Bench_Press_-_Medium_Grip",
    "priority_score": 40
  },
  {
    "name": "Barbell Guillotine Bench Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position.",
      "As you breathe in, bring the bar down slowly until it is about 1 inch from your neck.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. It should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Barbell_Guillotine_Bench_Press/0.jpg",
      "Barbell_Guillotine_Bench_Press/1.jpg"
    ],
    "id": "Barbell_Guillotine_Bench_Press",
    "priority_score": 40
  },
  {
    "name": "Barbell Incline Bench Press - Medium Grip",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on an incline bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "As you breathe in, come down slowly until you feel the bar on you upper chest.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly again. Tip: it should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Barbell_Incline_Bench_Press_-_Medium_Grip/0.jpg",
      "Barbell_Incline_Bench_Press_-_Medium_Grip/1.jpg"
    ],
    "id": "Barbell_Incline_Bench_Press_-_Medium_Grip",
    "priority_score": 40
  },
  {
    "name": "Barbell Shoulder Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "chest",
      "triceps"
    ],
    "instructions": [
      "Sit on a bench with back support in a squat rack. Position a barbell at a height that is just above your head. Grab the barbell with a pronated grip (palms facing forward).",
      "Once you pick up the barbell with the correct grip width, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.",
      "Lower the bar down to the shoulders slowly as you inhale.",
      "Lift the bar back up to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Shoulder_Press/0.jpg",
      "Barbell_Shoulder_Press/1.jpg"
    ],
    "id": "Barbell_Shoulder_Press",
    "priority_score": 40
  },
  {
    "name": "Carioca Quick Step",
    "force": null,
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [
      "abdominals",
      "abductors",
      "calves",
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Begin with your feet a few inches apart and your left arm up in a relaxed, athletic position.",
      "With your right foot, quick step behind and pull the knee up.",
      "Fire your arms back up when you pull the right knee, being sure that your knee goes straight up and down. Avoid turning your feet as you move and continue to look forward as you move to the side."
    ],
    "category": "plyometrics",
    "images": [
      "Carioca_Quick_Step/0.jpg",
      "Carioca_Quick_Step/1.jpg"
    ],
    "id": "Carioca_Quick_Step",
    "priority_score": 40
  },
  {
    "name": "Close-Grip Barbell Bench Press",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Lie back on a flat bench. Using a close grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that - as opposed to a regular bench press - you keep the elbows close to the torso at all times in order to maximize triceps involvement.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Close-Grip_Barbell_Bench_Press/0.jpg",
      "Close-Grip_Barbell_Bench_Press/1.jpg"
    ],
    "id": "Close-Grip_Barbell_Bench_Press",
    "priority_score": 40
  },
  {
    "name": "Crossover Reverse Lunge",
    "force": "pull",
    "level": "intermediate",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "abdominals",
      "abductors",
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Stand with your feet shoulder width apart. This will be your starting position.",
      "Perform a rear lunge by stepping back with one foot and flexing the hips and front knee. As you do so, rotate your torso across the front leg.",
      "After a brief pause, return to the starting position and repeat on the other side, continuing in an alternating fashion."
    ],
    "category": "stretching",
    "images": [
      "Crossover_Reverse_Lunge/0.jpg",
      "Crossover_Reverse_Lunge/1.jpg"
    ],
    "id": "Crossover_Reverse_Lunge",
    "priority_score": 40
  },
  {
    "name": "Decline Barbell Bench Press",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Secure your legs at the end of the decline bench and slowly lay down on the bench.",
      "Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.",
      "As you breathe in, come down slowly until you feel the bar on your lower chest.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Decline_Barbell_Bench_Press/0.jpg",
      "Decline_Barbell_Bench_Press/1.jpg"
    ],
    "id": "Decline_Barbell_Bench_Press",
    "priority_score": 40
  },
  {
    "name": "Floor Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Adjust the j-hooks so they are at the appropriate height to rack the bar. Begin lying on the floor with your head near the end of a power rack. Keeping your shoulder blades pulled together; pull the bar off of the hooks.",
      "Lower the bar towards the bottom of your chest or upper stomach, squeezing the bar and attempting to pull it apart as you do so. Ensure that you tuck your elbows throughout the movement. Lower the bar until your upper arm contacts the ground and pause, preventing any slamming or bouncing of the weight.",
      "Press the bar back up as fast as you can, keeping the bar, your wrists, and elbows in line as you do so."
    ],
    "category": "powerlifting",
    "images": [
      "Floor_Press/0.jpg",
      "Floor_Press/1.jpg"
    ],
    "id": "Floor_Press",
    "priority_score": 40
  },
  {
    "name": "Floor Press with Chains",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Adjust the j-hooks so they are at the appropriate height to rack the bar. For this exercise, drape the chains directly over the end of the bar, trying to keep the ends away from the plates.",
      "Begin lying on the floor with your head near the end of a power rack. Keeping your shoulder blades pulled together, pull the bar off of the hooks.",
      "Lower the bar towards the bottom of your chest or upper stomach, squeezing the bar and attempting to pull it apart as you do so. Ensure that you tuck your elbows throughout the movement. Lower the bar until your upper arm contacts the ground and pause, preventing any slamming or bouncing of the weight.",
      "Press the bar back up as fast as you can, keeping the bar, your wrists, and elbows in line as you do so."
    ],
    "category": "powerlifting",
    "images": [
      "Floor_Press_with_Chains/0.jpg",
      "Floor_Press_with_Chains/1.jpg"
    ],
    "id": "Floor_Press_with_Chains",
    "priority_score": 40
  },
  {
    "name": "Incline Bench Pull",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Grab a dumbbell in each hand and lie face down on an incline bench that is set to an incline that is approximately 30 degrees.",
      "Let the arms hang to your sides fully extended as they point to the floor.",
      "Turn the wrists until your hands have a pronated (palms down) grip.",
      "Now flare the elbows out. This will be your starting position.",
      "As you breathe out, start to pull the dumbbells up as if you are doing a reverse bench press. You will do this by bending at the elbows and bringing the upper arms up as you let the forearms hang. Continue this motion until the upper arms are at the same level as your back. Tip: The elbows will come out to the side and your upper arms and torso should make the letter \"T\" at the top of the movement. Hold the contraction at the top for a second.",
      "Slowly go back down to the starting position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Incline_Bench_Pull/0.jpg",
      "Incline_Bench_Pull/1.jpg"
    ],
    "id": "Incline_Bench_Pull",
    "priority_score": 40
  },
  {
    "name": "Isometric Wipers",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Assume a push-up position, supporting your weight on your hands and toes while keeping your body straight. Your hands should be just outside of shoulder width. This will be your starting position.",
      "Begin by shifting your body weight as far to one side as possible, allowing the elbow on that side to flex as you lower your body.",
      "Reverse the motion by extending the flexed arm, pushing yourself up and then dropping to the other side.",
      "Repeat for the desired number of repetitions."
    ],
    "category": "strength",
    "images": [
      "Isometric_Wipers/0.jpg",
      "Isometric_Wipers/1.jpg"
    ],
    "id": "Isometric_Wipers",
    "priority_score": 40
  },
  {
    "name": "JM Press",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Start the exercise the same way you would a close grip bench press. You will lie on a flat bench while holding a barbell at arms length (fully extended) with the elbows in. However, instead of having the arms perpendicular to the torso, make sure the bar is set in a direct line above the upper chest. This will be your starting position.",
      "Now beginning from a fully extended position lower the bar down as if performing a lying triceps extension. Inhale as you perform this movement. When you reach the half way point, let the bar roll back about one inch by moving the upper arms towards your legs until they are perpendicular to the torso. Tip: Keep the bend at the elbows constant as you bring the upper arms forward.",
      "As you exhale, press the bar back up by using the triceps to perform a close grip bench press.",
      "Now go back to the starting position and start over.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "JM_Press/0.jpg",
      "JM_Press/1.jpg"
    ],
    "id": "JM_Press",
    "priority_score": 40
  },
  {
    "name": "Kneeling Squat",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "abdominals",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight.",
      "With your head looking forward, sit back with your butt until you touch your calves.",
      "Reverse the motion, returning the torso to an upright position."
    ],
    "category": "powerlifting",
    "images": [
      "Kneeling_Squat/0.jpg",
      "Kneeling_Squat/1.jpg"
    ],
    "id": "Kneeling_Squat",
    "priority_score": 40
  },
  {
    "name": "Neck Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on a flat bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position.",
      "As you breathe in, come down slowly until you feel the bar on your neck.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Neck_Press/0.jpg",
      "Neck_Press/1.jpg"
    ],
    "id": "Neck_Press",
    "priority_score": 40
  },
  {
    "name": "One Arm Floor Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Lie down on a flat surface with your back pressing against the floor or an exercise mat. Make sure your knees are bent.",
      "Have a partner hand you the bar on one hand. When starting, your arm should be just about fully extended, similar to the starting position of a barbell bench press. However, this time your grip will be neutral (palms facing your torso).",
      "Make sure the hand you are not using to lift the weight is placed by your side.",
      "Begin the exercise by lowering the barbell until your elbow touches the ground. Make sure to breathe in as this is the eccentric (lowering part of the exercise).",
      "Then start lifting the barbell back up to the original starting position. Remember to breathe out during the concentric (lifting part of the exercise).",
      "Repeat until you have performed your recommended repetitions.",
      "Switch arms and repeat the movement."
    ],
    "category": "strength",
    "images": [
      "One_Arm_Floor_Press/0.jpg",
      "One_Arm_Floor_Press/1.jpg"
    ],
    "id": "One_Arm_Floor_Press",
    "priority_score": 40
  },
  {
    "name": "Push Press",
    "force": "push",
    "level": "expert",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "quadriceps",
      "triceps"
    ],
    "instructions": [],
    "category": "olympic weightlifting",
    "images": [
      "Push_Press/0.jpg",
      "Push_Press/1.jpg"
    ],
    "id": "Push_Press",
    "priority_score": 40
  }
]